{
  "platformId": "netflix",
  "lastUpdated": "2026-02-26",
  "categorySummaries": [
    {
      "categoryId": "login-flow",
      "summary": "Netflix login is a two-step process: email entry on the first page, then password on the second. Google reCAPTCHA is present on the login page, which complicates automation. After login, users land on the 'Who's watching?' profile picker showing all 5 profiles with Kids badges visible.",
      "automationFeasibility": "partially_automatable",
      "keyTakeaways": [
        "Two-step login: email first, then password on next page",
        "Google reCAPTCHA present — bot detection is active",
        "Profile picker appears after login with all 5 profiles",
        "Session cookies (NetflixId, SecureNetflixId) extracted post-login last ~2 weeks",
        "No OAuth or delegated auth — credential-based login is the only option"
      ],
      "relatedAdapterMethods": [
        "authenticate"
      ],
      "comparisonSummary": "Similar to Peacock's credential-based login, but Netflix has stronger bot detection (reCAPTCHA). Neither platform offers OAuth for third-party parental control tools."
    },
    {
      "categoryId": "profile-management",
      "summary": "Netflix supports up to 5 profiles per account. Three types observed: standard adult profiles (Ramsay!, Mom and dad), and Kids profiles (Samson, Chap, BANANA!!!!!!!!). Kids profiles show a red 'kids' badge on avatars and provide a completely different browsing UI. Profile editing includes name, avatar, language, maturity level, autoplay settings, and Kids toggle.",
      "automationFeasibility": "partially_automatable",
      "keyTakeaways": [
        "Max 5 profiles per account — must check available slots before creating",
        "Kids profiles have distinct red badge and restricted browsing UI",
        "Profile edit pages accessible via Manage Profiles flow",
        "Each profile has independent settings for maturity, autoplay, language",
        "Profile Lock (PIN) is a separate setting per profile",
        "Kids toggle visible on profile edit — converts between standard and kids mode"
      ],
      "relatedAdapterMethods": [
        "listProfiles",
        "createKidsProfile",
        "getProfileSettings"
      ],
      "comparisonSummary": "Netflix offers 5 profiles vs Peacock's 6. Netflix's Kids profiles provide a fully separate UI experience, while Peacock's kids profiles are more limited in UI differentiation."
    },
    {
      "categoryId": "parental-controls",
      "summary": "Parental controls are accessible per-profile under 'Manage profile and preferences'. Key settings include maturity rating level (4 tiers), title-specific restrictions, and profile lock PIN. All write operations to parental controls require MFA verification (email code, SMS code, or password confirmation). The MFA gate is the primary security barrier for automation.",
      "automationFeasibility": "partially_automatable",
      "keyTakeaways": [
        "4 maturity tiers: Little Kids, Older Kids, Teens, All Maturity Ratings",
        "Per-title blocking available under Viewing Restrictions",
        "All parental control changes require MFA verification",
        "MFA offers 3 methods: email code, SMS text, or password confirmation",
        "Kids profiles have fewer visible settings (no Notification settings, no Privacy settings)",
        "Parental controls accessed via Account > Profile & Parental Controls > [Profile]"
      ],
      "relatedAdapterMethods": [
        "setContentRestrictions",
        "setTitleRestrictions",
        "getProfileSettings"
      ],
      "comparisonSummary": "Netflix's MFA gate on parental controls is stronger than Peacock's approach. Netflix has 4 maturity tiers vs Peacock's simpler kids/non-kids model. Both lack native screen time controls."
    },
    {
      "categoryId": "mfa-verification",
      "summary": "Netflix requires multi-factor authentication before allowing any parental control changes. The MFA page presents three options: email a code, text a code (SMS), or confirm password. This gate activates when navigating to parental control settings, maturity settings, or profile management from certain paths. Password confirmation is the simplest path for automation.",
      "automationFeasibility": "partially_automatable",
      "keyTakeaways": [
        "MFA triggered on parental control write operations",
        "Three verification methods: email code, SMS code, password re-entry",
        "Password confirmation is the most automatable MFA path",
        "MFA is session-based — once verified, changes can be made within that session",
        "Direct URL navigation to parental controls also triggers MFA",
        "Profile picker modal appears during MFA flow for profile selection"
      ],
      "relatedAdapterMethods": [
        "authenticate",
        "setContentRestrictions",
        "setTitleRestrictions",
        "setProfilePIN"
      ],
      "comparisonSummary": "Netflix's MFA is more robust than most streaming platforms. Peacock does not require MFA for parental control changes, making Netflix significantly harder to automate for write operations."
    },
    {
      "categoryId": "viewing-activity",
      "summary": "Netflix provides per-profile viewing activity showing title name, date watched, and episode/season info in chronological order. Data can be downloaded as CSV. Individual titles can be hidden from history. No watch duration, real-time status, or weekly summaries are available. The Shakti API endpoint /api/shakti/*/viewingactivity can be used for programmatic reads.",
      "automationFeasibility": "partially_automatable",
      "keyTakeaways": [
        "Per-profile viewing history with title + date + episode info",
        "CSV download available via 'Download all' link",
        "Individual titles can be hidden (permanently removed from history)",
        "No watch duration or session length data",
        "Shakti API supports read-only access to viewing activity",
        "Show More pagination for large histories"
      ],
      "relatedAdapterMethods": [
        "getWatchHistory"
      ],
      "comparisonSummary": "Netflix viewing history is more detailed than Peacock's, with CSV export and per-episode tracking. Neither platform provides watch duration data, which limits Phosra's screen time monitoring accuracy."
    },
    {
      "categoryId": "profile-lock-pin",
      "summary": "Netflix offers per-profile PIN locks using a 4-digit numeric code. The Profile Lock page allows creating, changing, or removing a PIN. A note indicates account password is required when making changes. This feature is critical for Phosra's screen time enforcement strategy — locking/unlocking profiles by managing the PIN.",
      "automationFeasibility": "partially_automatable",
      "keyTakeaways": [
        "4-digit numeric PIN per profile",
        "Password re-entry required to create/change PIN (not full MFA)",
        "PIN prevents unauthorized profile switching",
        "Primary mechanism for Phosra's screen time enforcement",
        "PIN can be set on any profile including Kids profiles",
        "Lock icon visible on profile picker for locked profiles"
      ],
      "relatedAdapterMethods": [
        "setProfilePIN",
        "lockProfile",
        "unlockProfile"
      ],
      "comparisonSummary": "Netflix's per-profile PIN is similar to Peacock's profile lock concept but Netflix's is more prominently featured and better integrated. Both use 4-digit PINs."
    },
    {
      "categoryId": "kids-experience",
      "summary": "Netflix Kids profiles provide a completely separate browsing experience with simplified navigation, colorful design, large thumbnails, character-based browsing, and content restricted to age-appropriate ratings (TV-PG PG and below for Older Kids profiles). The Kids UI has no access to account settings, search for mature content, or profile switching without exiting.",
      "automationFeasibility": "not_applicable",
      "keyTakeaways": [
        "Completely different UI from standard Netflix browsing",
        "Character-based navigation rows for kid-friendly browsing",
        "Content limited to profile's maturity tier (e.g., TV-PG PG and below)",
        "No access to account settings or mature content search",
        "Continue Watching row shows per-profile viewing progress",
        "Top 10 Kids Movies/Shows featured prominently"
      ],
      "relatedAdapterMethods": [
        "createKidsProfile",
        "getProfileSettings"
      ],
      "comparisonSummary": "Netflix's Kids experience is significantly more polished than Peacock's, with dedicated character browsing, curated rows, and a fully distinct UI. This is an industry-leading kids content experience."
    },
    {
      "categoryId": "account-settings",
      "summary": "Netflix account settings are organized into 5 sections via left sidebar: Overview, Membership, Security, Devices, and Profiles. The Overview page shows membership status, payment info, and quick links to key settings including 'Adjust parental controls'. Security shows email, phone, password, and privacy options. Devices shows signed-in devices and download device management.",
      "automationFeasibility": "partially_automatable",
      "keyTakeaways": [
        "5-section account layout: Overview, Membership, Security, Devices, Profiles",
        "Quick link to 'Adjust parental controls' on Overview page",
        "Security page shows verified email and phone number",
        "Profile Transfer feature available (new) — Kids profiles cannot be transferred",
        "Device management shows 4 of 6 download devices in use",
        "Manage Profiles accessible from Overview and profile picker"
      ],
      "relatedAdapterMethods": [
        "authenticate",
        "listProfiles"
      ],
      "comparisonSummary": "Netflix's account settings are more comprehensive than Peacock's, with dedicated sections for security and device management. Both platforms centralize parental controls under account settings."
    },
    {
      "categoryId": "playback-settings",
      "summary": "Per-profile playback settings include autoplay next episode toggle, autoplay previews toggle, and data usage per screen (Auto/Low/Medium/High). These settings apply across all devices. Disabling autoplay is a key Phosra strategy to reduce passive binge-watching for children.",
      "automationFeasibility": "partially_automatable",
      "keyTakeaways": [
        "Autoplay next episode toggle (per-profile, cross-device)",
        "Autoplay previews toggle (per-profile, cross-device)",
        "Data usage settings: Auto, Low (0.3GB/hr), Medium (0.7GB/hr), High (3-7GB/hr)",
        "Disabling autoplay reduces passive viewing — key Phosra strategy",
        "No screen time controls in playback settings"
      ],
      "relatedAdapterMethods": [
        "getProfileSettings"
      ],
      "comparisonSummary": "Netflix's autoplay controls are more granular than Peacock's. The autoplay disable strategy is unique to Netflix as a passive screen time reduction measure."
    },
    {
      "categoryId": "privacy-settings",
      "summary": "Per-profile privacy settings include Profile Lock, Viewing Activity access, and Data Privacy controls. The 'Matched Identifier Communications' toggle controls whether Netflix uses contact info for third-party marketing. An 'Opt Out of All' button is available. These settings are relevant for COPPA and child data protection compliance.",
      "automationFeasibility": "partially_automatable",
      "keyTakeaways": [
        "Profile Lock and Viewing Activity accessible from privacy page",
        "Matched Identifier Communications toggle for marketing opt-out",
        "Opt Out of All button for bulk privacy preference",
        "Relevant for COPPA compliance on child profiles",
        "Per-profile privacy settings, not account-wide"
      ],
      "relatedAdapterMethods": [
        "getProfileSettings"
      ],
      "comparisonSummary": "Netflix's privacy controls are more transparent than Peacock's, with explicit opt-out options. Both platforms handle child privacy at the profile level."
    },
    {
      "categoryId": "deep-dive-per-profile",
      "summary": "Deep-dive screenshots capture per-profile settings pages for all 5 profiles (Ramsay!, MomAndDad, Samson, Chap, BANANA!!!). Each profile's settings, parental controls, playback, privacy, profile lock, and viewing activity pages were captured. Kids profiles (Samson, Chap, BANANA!!!) show fewer settings options — no Notification settings or Privacy and data settings sections. All profiles show consistent 'Manage profile and preferences' layout.",
      "automationFeasibility": "partially_automatable",
      "keyTakeaways": [
        "All 5 profiles have consistent settings structure",
        "Kids profiles have reduced settings (no notifications, no full privacy section)",
        "Parental controls expandable section shows maturity tier per profile",
        "Each profile's viewing activity is independently accessible",
        "Profile-specific playback settings (autoplay toggles)",
        "Delete Profile option visible on non-primary profiles"
      ],
      "relatedAdapterMethods": [
        "listProfiles",
        "getProfileSettings",
        "getWatchHistory"
      ],
      "comparisonSummary": "Netflix's per-profile settings granularity exceeds Peacock's. The deep-dive reveals that Kids profiles intentionally restrict available settings, which is a security-positive design."
    }
  ],
  "screenshots": {
    "01-login-page.png": {
      "filename": "01-login-page.png",
      "description": "Netflix login page showing 'Enter your info to sign in' heading with email/mobile input field, red Continue button, Get Help link, and Google reCAPTCHA notice at bottom. Dark background with Netflix logo.",
      "phosraRelevance": "Entry point for Phosra's authenticate() method. The two-step login flow (email first, then password) must be handled by Playwright automation. reCAPTCHA presence is a critical bot detection challenge.",
      "relatedRuleCategories": [
        "parental_consent_gate",
        "age_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright browser automation with stealth mode",
        "notes": "reCAPTCHA on login page requires stealth mode to avoid detection. Two-step flow means separate page loads for email and password entry.",
        "technicalDetails": "Navigate to netflix.com/login, fill email input[name='userLoginId'], click Continue, wait for password page. Use playwright-extra stealth plugin to bypass reCAPTCHA."
      },
      "findings": [
        {
          "label": "reCAPTCHA present",
          "detail": "Google reCAPTCHA is active on the login page — 'This page is protected by Google reCAPTCHA to ensure you're not a bot'",
          "severity": "critical"
        },
        {
          "label": "Two-step login",
          "detail": "Email and password are on separate pages, requiring two form submissions",
          "severity": "important"
        },
        {
          "label": "No OAuth",
          "detail": "No social login or third-party auth options visible — credential-based login only",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Minimal, clean login UI with clear input field and prominent Continue button. Dark theme consistent with Netflix branding."
      },
      "securityNotes": [
        "Google reCAPTCHA bot detection active",
        "No CAPTCHA image challenge observed but may trigger on suspicious activity"
      ],
      "apiIndicators": [
        "No OAuth endpoint available — session cookie extraction is only auth method"
      ],
      "comparisonNotes": "Similar to Peacock's credential login but with stronger reCAPTCHA protection. Neither offers OAuth for third-party tools.",
      "gapsIdentified": [
        "No OAuth or delegated auth pathway",
        "reCAPTCHA may block automated login attempts"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "02-login-filled.png": {
      "filename": "02-login-filled.png",
      "description": "Netflix login page with email field filled in (jake.k.klinvex@gmail.com). Same layout as 01 but with populated email input ready to click Continue.",
      "phosraRelevance": "Demonstrates the email entry step of the authenticate() flow. Playwright fills the email field and clicks Continue to proceed to password step.",
      "relatedRuleCategories": [
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright fill() and click()",
        "notes": "Straightforward form fill. Email input accepts email or mobile number format.",
        "technicalDetails": "await page.fill('input[name=\"userLoginId\"]', email); await page.click('button:has-text(\"Continue\")');"
      },
      "findings": [
        {
          "label": "Email format accepted",
          "detail": "Standard email address format works in the input field",
          "severity": "informational"
        },
        {
          "label": "Continue button enabled",
          "detail": "Button is always enabled — validation happens server-side after click",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Simple form with clear email field populated. Good contrast between input and button."
      },
      "securityNotes": [
        "Email address visible in plaintext in input field"
      ],
      "apiIndicators": [
        "Form POST to Netflix login endpoint after Continue click"
      ],
      "comparisonNotes": "Standard credential input step. Both Netflix and Peacock require email-first login flows.",
      "gapsIdentified": [],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "03-after-login.png": {
      "filename": "03-after-login.png",
      "description": "Post-login state showing the Netflix interface after successful authentication. This confirms the login flow completed successfully.",
      "phosraRelevance": "Validates that authenticate() completed. Session cookies are now available for extraction (NetflixId, SecureNetflixId).",
      "relatedRuleCategories": [
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright cookie extraction",
        "notes": "After successful login, extract session cookies for API reuse. Cookies last ~2 weeks.",
        "technicalDetails": "const cookies = await context.cookies(); const netflixId = cookies.find(c => c.name === 'NetflixId');"
      },
      "findings": [
        {
          "label": "Login successful",
          "detail": "Post-login page confirms authentication completed without MFA challenge",
          "severity": "informational"
        },
        {
          "label": "Session established",
          "detail": "Session cookies now available for Falcor/Shakti API calls",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Smooth transition from login to authenticated state."
      },
      "securityNotes": [
        "Session cookies set with ~2 week TTL"
      ],
      "apiIndicators": [
        "NetflixId and SecureNetflixId cookies available for API calls"
      ],
      "comparisonNotes": "Both Netflix and Peacock establish session cookies post-login for API access.",
      "gapsIdentified": [],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "04-profile-picker.png": {
      "filename": "04-profile-picker.png",
      "description": "Netflix 'Who's watching?' profile picker showing 5 profiles: Ramsay! (dinosaur avatar), Mom and dad (green smiley, lock icon), Samson (crab, kids badge), Chap (shark, kids badge), BANANA!!!!!!!! (golden retriever, kids badge). 'Manage Profiles' button at bottom.",
      "phosraRelevance": "Critical for listProfiles() and profile-to-child mapping. Shows all 5 profiles with visual indicators: Kids badges (red 'kids' label) on child profiles and lock icon on PIN-protected profiles. Phosra must map each child to their Netflix profile.",
      "relatedRuleCategories": [
        "kids_profile",
        "profile_lock",
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Falcor API or Playwright DOM scraping",
        "notes": "Profile data readable via Falcor pathEvaluator. Profile GUIDs extracted for subsequent API calls. Lock icon indicates PIN-protected profile.",
        "technicalDetails": "Falcor path: ['profiles', 'current', ['name', 'maturityLevel', 'isKids', 'guid']]. Alternatively, scrape profile picker DOM for names and kids badges."
      },
      "findings": [
        {
          "label": "5 profiles visible",
          "detail": "Account has maximum 5 profiles — no room to create additional profiles",
          "severity": "important"
        },
        {
          "label": "Kids badges visible",
          "detail": "3 profiles (Samson, Chap, BANANA!!!!!!!!) show red 'kids' badge on avatar",
          "severity": "important"
        },
        {
          "label": "Lock icon on profile",
          "detail": "Mom and dad profile shows lock icon indicating PIN protection is enabled",
          "severity": "important"
        },
        {
          "label": "Manage Profiles button",
          "detail": "Button available for profile management access",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear visual differentiation between adult and kids profiles via badges. Lock icon is subtle but visible."
      },
      "securityNotes": [
        "Profile lock icon reveals which profiles have PIN protection"
      ],
      "apiIndicators": [
        "Profile list available via Falcor API without MFA",
        "x-netflix-profileguid header used for profile-scoped requests"
      ],
      "comparisonNotes": "Netflix shows 5 profiles with kids badges vs Peacock's 6-profile limit. Netflix's kids badge visual is more prominent than Peacock's approach.",
      "gapsIdentified": [
        "No visual indicator of maturity tier on profile picker — must check settings"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "05-manage-profiles.png": {
      "filename": "05-manage-profiles.png",
      "description": "Netflix Manage Profiles page showing edit interface for profile management. Allows editing, adding, or deleting profiles.",
      "phosraRelevance": "Entry point for createKidsProfile() and profile configuration. Shows the profile management interface used by Playwright for write operations.",
      "relatedRuleCategories": [
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation and interaction",
        "notes": "Navigate to Manage Profiles, then click on specific profile or Add Profile button.",
        "technicalDetails": "await page.goto('https://www.netflix.com/ManageProfiles'); await page.click('[data-profile-guid=\"...\"]');"
      },
      "findings": [
        {
          "label": "Profile management accessible",
          "detail": "Manage Profiles page reachable from profile picker without MFA",
          "severity": "informational"
        },
        {
          "label": "Edit mode available",
          "detail": "Pencil/edit icons visible on profiles for editing",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard profile management grid layout."
      },
      "securityNotes": [],
      "apiIndicators": [
        "No MFA required to access profile management page"
      ],
      "comparisonNotes": "Similar profile management layout to Peacock. Both allow profile editing without additional auth.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "06-account-overview.png": {
      "filename": "06-account-overview.png",
      "description": "Account page showing 'Account > Membership Details' with Premium plan, member since August 2022, next payment March 2, 2026. Quick Links section includes Change plan, Manage payment, Buy extra member slot (New), Manage access and devices, Update password, Transfer a profile, Adjust parental controls, Edit settings. Bottom shows Manage profiles with 5 profile avatars.",
      "phosraRelevance": "Maps the account settings navigation structure. 'Adjust parental controls' quick link is the entry point for parental control automation. Account page provides overview of subscription and profile management.",
      "relatedRuleCategories": [
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation",
        "notes": "Account overview is the hub for navigating to parental controls, profiles, and security settings.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account');"
      },
      "findings": [
        {
          "label": "Parental controls quick link",
          "detail": "'Adjust parental controls' is directly accessible from Account overview",
          "severity": "important"
        },
        {
          "label": "Premium plan confirmed",
          "detail": "Account is on Premium tier — 4 simultaneous streams, relevant for device management",
          "severity": "informational"
        },
        {
          "label": "5 profiles shown",
          "detail": "Manage profiles section shows all 5 profile avatars at bottom of page",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Well-organized account page with clear quick links section. Settings grouped logically."
      },
      "securityNotes": [
        "Payment info partially masked (ja***@gmail.com)"
      ],
      "apiIndicators": [
        "Account page accessible with session cookies, no additional auth"
      ],
      "comparisonNotes": "Netflix's account page is more feature-rich than Peacock's, with dedicated sections for membership, security, devices, and profiles in sidebar navigation.",
      "gapsIdentified": [
        "No screen time settings anywhere on account page — confirms Netflix has zero native screen time features"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "07-account-overview-mid.png": {
      "filename": "07-account-overview-mid.png",
      "description": "Middle section of the Account overview page showing additional quick links and settings options.",
      "phosraRelevance": "Maps the account settings navigation structure. 'Adjust parental controls' quick link is the entry point for parental control automation. Account page provides overview of subscription and profile management.",
      "relatedRuleCategories": [
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation",
        "notes": "Account overview is the hub for navigating to parental controls, profiles, and security settings.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account');"
      },
      "findings": [
        {
          "label": "Parental controls quick link",
          "detail": "'Adjust parental controls' is directly accessible from Account overview",
          "severity": "important"
        },
        {
          "label": "Premium plan confirmed",
          "detail": "Account is on Premium tier — 4 simultaneous streams, relevant for device management",
          "severity": "informational"
        },
        {
          "label": "5 profiles shown",
          "detail": "Manage profiles section shows all 5 profile avatars at bottom of page",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Well-organized account page with clear quick links section. Settings grouped logically."
      },
      "securityNotes": [
        "Payment info partially masked (ja***@gmail.com)"
      ],
      "apiIndicators": [
        "Account page accessible with session cookies, no additional auth"
      ],
      "comparisonNotes": "Netflix's account page is more feature-rich than Peacock's, with dedicated sections for membership, security, devices, and profiles in sidebar navigation.",
      "gapsIdentified": [
        "No screen time settings anywhere on account page — confirms Netflix has zero native screen time features"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "08-account-overview-bottom.png": {
      "filename": "08-account-overview-bottom.png",
      "description": "Bottom section of the Account overview page showing Manage profiles section with all 5 profile avatar thumbnails.",
      "phosraRelevance": "Maps the account settings navigation structure. 'Adjust parental controls' quick link is the entry point for parental control automation. Account page provides overview of subscription and profile management.",
      "relatedRuleCategories": [
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation",
        "notes": "Account overview is the hub for navigating to parental controls, profiles, and security settings.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account');"
      },
      "findings": [
        {
          "label": "Parental controls quick link",
          "detail": "'Adjust parental controls' is directly accessible from Account overview",
          "severity": "important"
        },
        {
          "label": "Premium plan confirmed",
          "detail": "Account is on Premium tier — 4 simultaneous streams, relevant for device management",
          "severity": "informational"
        },
        {
          "label": "5 profiles shown",
          "detail": "Manage profiles section shows all 5 profile avatars at bottom of page",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Well-organized account page with clear quick links section. Settings grouped logically."
      },
      "securityNotes": [
        "Payment info partially masked (ja***@gmail.com)"
      ],
      "apiIndicators": [
        "Account page accessible with session cookies, no additional auth"
      ],
      "comparisonNotes": "Netflix's account page is more feature-rich than Peacock's, with dedicated sections for membership, security, devices, and profiles in sidebar navigation.",
      "gapsIdentified": [
        "No screen time settings anywhere on account page — confirms Netflix has zero native screen time features"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "09-account-overview-end.png": {
      "filename": "09-account-overview-end.png",
      "description": "End of Account overview page showing footer links and final settings options.",
      "phosraRelevance": "Maps the account settings navigation structure. 'Adjust parental controls' quick link is the entry point for parental control automation. Account page provides overview of subscription and profile management.",
      "relatedRuleCategories": [
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation",
        "notes": "Account overview is the hub for navigating to parental controls, profiles, and security settings.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account');"
      },
      "findings": [
        {
          "label": "Parental controls quick link",
          "detail": "'Adjust parental controls' is directly accessible from Account overview",
          "severity": "important"
        },
        {
          "label": "Premium plan confirmed",
          "detail": "Account is on Premium tier — 4 simultaneous streams, relevant for device management",
          "severity": "informational"
        },
        {
          "label": "5 profiles shown",
          "detail": "Manage profiles section shows all 5 profile avatars at bottom of page",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Well-organized account page with clear quick links section. Settings grouped logically."
      },
      "securityNotes": [
        "Payment info partially masked (ja***@gmail.com)"
      ],
      "apiIndicators": [
        "Account page accessible with session cookies, no additional auth"
      ],
      "comparisonNotes": "Netflix's account page is more feature-rich than Peacock's, with dedicated sections for membership, security, devices, and profiles in sidebar navigation.",
      "gapsIdentified": [
        "No screen time settings anywhere on account page — confirms Netflix has zero native screen time features"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "10-parental-controls-landing.png": {
      "filename": "10-parental-controls-landing.png",
      "description": "Parental controls landing page showing initial entry point for adjusting parental controls per profile.",
      "phosraRelevance": "Entry point for all parental control operations. This is where the MFA gate typically triggers before allowing changes.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + MFA handling",
        "notes": "Navigating to parental controls triggers MFA verification before any changes can be made.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account/parental-controls'); // triggers MFA"
      },
      "findings": [
        {
          "label": "MFA gate location",
          "detail": "MFA verification triggers when accessing parental control settings for editing",
          "severity": "critical"
        },
        {
          "label": "Per-profile controls",
          "detail": "Parental controls are managed per-profile, not account-wide",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear entry point for parental controls. Follows Netflix's standard settings page layout."
      },
      "securityNotes": [
        "MFA required before any parental control modifications"
      ],
      "apiIndicators": [
        "Parental controls read via /api/shakti/*/parentalControls endpoint"
      ],
      "comparisonNotes": "Netflix requires MFA for parental controls; Peacock does not. This makes Netflix significantly harder to automate.",
      "gapsIdentified": [
        "MFA gate adds complexity to all write operations"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "12-parental-controls-main.png": {
      "filename": "12-parental-controls-main.png",
      "description": "Parental controls settings page (main view) for Ramsay! profile showing 'Manage profile and preferences' heading. Visible sections: profile info (Edit personal and contact info), Profile Lock (Require a PIN), Preferences section with Languages, Adjust Parental Controls (Edit maturity rating and title restrictions), Subtitle appearance, Playback settings, Notification settings, Viewing activity, Privacy and data settings. Delete Profile button at bottom.",
      "phosraRelevance": "Documents the full parental controls settings layout. 'Adjust Parental Controls' link leads to maturity rating and title restriction settings (behind MFA). Profile Lock leads to PIN configuration. This page is the central hub for all per-profile Phosra operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "profile_lock",
        "autoplay_control",
        "viewing_history_access"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation to specific settings sections",
        "notes": "Each settings link navigates to a dedicated page. Parental controls and PIN changes require password/MFA verification.",
        "technicalDetails": "await page.click('text=Adjust Parental Controls'); // navigates to maturity settings, may trigger MFA"
      },
      "findings": [
        {
          "label": "Comprehensive settings hub",
          "detail": "Single page provides access to all per-profile settings including parental controls, PIN, playback, viewing activity, and privacy",
          "severity": "important"
        },
        {
          "label": "Delete Profile option",
          "detail": "Delete Profile button visible at bottom — 'The primary profile cannot be deleted' note shown",
          "severity": "informational"
        },
        {
          "label": "8 settings categories",
          "detail": "Languages, Parental Controls, Subtitle, Playback, Notifications, Viewing Activity, Privacy all accessible from this page",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Well-organized settings page with clear section headers and descriptive subtitles for each option."
      },
      "securityNotes": [
        "Profile Lock setting visible — indicates PIN can be configured from this page"
      ],
      "apiIndicators": [
        "Settings page readable without MFA — only write operations trigger verification"
      ],
      "comparisonNotes": "Netflix's per-profile settings page is more comprehensive than Peacock's, with more granular control options.",
      "gapsIdentified": [
        "No screen time settings visible — confirms absence of native screen time features"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "13-parental-controls-mid.png": {
      "filename": "13-parental-controls-mid.png",
      "description": "Parental controls settings page (middle section) for Ramsay! profile showing 'Manage profile and preferences' heading. Visible sections: profile info (Edit personal and contact info), Profile Lock (Require a PIN), Preferences section with Languages, Adjust Parental Controls (Edit maturity rating and title restrictions), Subtitle appearance, Playback settings, Notification settings, Viewing activity, Privacy and data settings. Delete Profile button at bottom.",
      "phosraRelevance": "Documents the full parental controls settings layout. 'Adjust Parental Controls' link leads to maturity rating and title restriction settings (behind MFA). Profile Lock leads to PIN configuration. This page is the central hub for all per-profile Phosra operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "profile_lock",
        "autoplay_control",
        "viewing_history_access"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation to specific settings sections",
        "notes": "Each settings link navigates to a dedicated page. Parental controls and PIN changes require password/MFA verification.",
        "technicalDetails": "await page.click('text=Adjust Parental Controls'); // navigates to maturity settings, may trigger MFA"
      },
      "findings": [
        {
          "label": "Comprehensive settings hub",
          "detail": "Single page provides access to all per-profile settings including parental controls, PIN, playback, viewing activity, and privacy",
          "severity": "important"
        },
        {
          "label": "Delete Profile option",
          "detail": "Delete Profile button visible at bottom — 'The primary profile cannot be deleted' note shown",
          "severity": "informational"
        },
        {
          "label": "8 settings categories",
          "detail": "Languages, Parental Controls, Subtitle, Playback, Notifications, Viewing Activity, Privacy all accessible from this page",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Well-organized settings page with clear section headers and descriptive subtitles for each option."
      },
      "securityNotes": [
        "Profile Lock setting visible — indicates PIN can be configured from this page"
      ],
      "apiIndicators": [
        "Settings page readable without MFA — only write operations trigger verification"
      ],
      "comparisonNotes": "Netflix's per-profile settings page is more comprehensive than Peacock's, with more granular control options.",
      "gapsIdentified": [
        "No screen time settings visible — confirms absence of native screen time features"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "14-parental-controls-bottom.png": {
      "filename": "14-parental-controls-bottom.png",
      "description": "Parental controls settings page (bottom section) for Ramsay! profile showing 'Manage profile and preferences' heading. Visible sections: profile info (Edit personal and contact info), Profile Lock (Require a PIN), Preferences section with Languages, Adjust Parental Controls (Edit maturity rating and title restrictions), Subtitle appearance, Playback settings, Notification settings, Viewing activity, Privacy and data settings. Delete Profile button at bottom.",
      "phosraRelevance": "Documents the full parental controls settings layout. 'Adjust Parental Controls' link leads to maturity rating and title restriction settings (behind MFA). Profile Lock leads to PIN configuration. This page is the central hub for all per-profile Phosra operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "profile_lock",
        "autoplay_control",
        "viewing_history_access"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation to specific settings sections",
        "notes": "Each settings link navigates to a dedicated page. Parental controls and PIN changes require password/MFA verification.",
        "technicalDetails": "await page.click('text=Adjust Parental Controls'); // navigates to maturity settings, may trigger MFA"
      },
      "findings": [
        {
          "label": "Comprehensive settings hub",
          "detail": "Single page provides access to all per-profile settings including parental controls, PIN, playback, viewing activity, and privacy",
          "severity": "important"
        },
        {
          "label": "Delete Profile option",
          "detail": "Delete Profile button visible at bottom — 'The primary profile cannot be deleted' note shown",
          "severity": "informational"
        },
        {
          "label": "8 settings categories",
          "detail": "Languages, Parental Controls, Subtitle, Playback, Notifications, Viewing Activity, Privacy all accessible from this page",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Well-organized settings page with clear section headers and descriptive subtitles for each option."
      },
      "securityNotes": [
        "Profile Lock setting visible — indicates PIN can be configured from this page"
      ],
      "apiIndicators": [
        "Settings page readable without MFA — only write operations trigger verification"
      ],
      "comparisonNotes": "Netflix's per-profile settings page is more comprehensive than Peacock's, with more granular control options.",
      "gapsIdentified": [
        "No screen time settings visible — confirms absence of native screen time features"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "15-parental-controls.png": {
      "filename": "15-parental-controls.png",
      "description": "Parental controls settings page (scrolled view) for Ramsay! profile showing 'Manage profile and preferences' heading. Visible sections: profile info (Edit personal and contact info), Profile Lock (Require a PIN), Preferences section with Languages, Adjust Parental Controls (Edit maturity rating and title restrictions), Subtitle appearance, Playback settings, Notification settings, Viewing activity, Privacy and data settings. Delete Profile button at bottom.",
      "phosraRelevance": "Documents the full parental controls settings layout. 'Adjust Parental Controls' link leads to maturity rating and title restriction settings (behind MFA). Profile Lock leads to PIN configuration. This page is the central hub for all per-profile Phosra operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "profile_lock",
        "autoplay_control",
        "viewing_history_access"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation to specific settings sections",
        "notes": "Each settings link navigates to a dedicated page. Parental controls and PIN changes require password/MFA verification.",
        "technicalDetails": "await page.click('text=Adjust Parental Controls'); // navigates to maturity settings, may trigger MFA"
      },
      "findings": [
        {
          "label": "Comprehensive settings hub",
          "detail": "Single page provides access to all per-profile settings including parental controls, PIN, playback, viewing activity, and privacy",
          "severity": "important"
        },
        {
          "label": "Delete Profile option",
          "detail": "Delete Profile button visible at bottom — 'The primary profile cannot be deleted' note shown",
          "severity": "informational"
        },
        {
          "label": "8 settings categories",
          "detail": "Languages, Parental Controls, Subtitle, Playback, Notifications, Viewing Activity, Privacy all accessible from this page",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Well-organized settings page with clear section headers and descriptive subtitles for each option."
      },
      "securityNotes": [
        "Profile Lock setting visible — indicates PIN can be configured from this page"
      ],
      "apiIndicators": [
        "Settings page readable without MFA — only write operations trigger verification"
      ],
      "comparisonNotes": "Netflix's per-profile settings page is more comprehensive than Peacock's, with more granular control options.",
      "gapsIdentified": [
        "No screen time settings visible — confirms absence of native screen time features"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "16-parental-controls-scrolled.png": {
      "filename": "16-parental-controls-scrolled.png",
      "description": "Parental controls settings page (scrolled view) for Ramsay! profile showing 'Manage profile and preferences' heading. Visible sections: profile info (Edit personal and contact info), Profile Lock (Require a PIN), Preferences section with Languages, Adjust Parental Controls (Edit maturity rating and title restrictions), Subtitle appearance, Playback settings, Notification settings, Viewing activity, Privacy and data settings. Delete Profile button at bottom.",
      "phosraRelevance": "Documents the full parental controls settings layout. 'Adjust Parental Controls' link leads to maturity rating and title restriction settings (behind MFA). Profile Lock leads to PIN configuration. This page is the central hub for all per-profile Phosra operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "profile_lock",
        "autoplay_control",
        "viewing_history_access"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation to specific settings sections",
        "notes": "Each settings link navigates to a dedicated page. Parental controls and PIN changes require password/MFA verification.",
        "technicalDetails": "await page.click('text=Adjust Parental Controls'); // navigates to maturity settings, may trigger MFA"
      },
      "findings": [
        {
          "label": "Comprehensive settings hub",
          "detail": "Single page provides access to all per-profile settings including parental controls, PIN, playback, viewing activity, and privacy",
          "severity": "important"
        },
        {
          "label": "Delete Profile option",
          "detail": "Delete Profile button visible at bottom — 'The primary profile cannot be deleted' note shown",
          "severity": "informational"
        },
        {
          "label": "8 settings categories",
          "detail": "Languages, Parental Controls, Subtitle, Playback, Notifications, Viewing Activity, Privacy all accessible from this page",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Well-organized settings page with clear section headers and descriptive subtitles for each option."
      },
      "securityNotes": [
        "Profile Lock setting visible — indicates PIN can be configured from this page"
      ],
      "apiIndicators": [
        "Settings page readable without MFA — only write operations trigger verification"
      ],
      "comparisonNotes": "Netflix's per-profile settings page is more comprehensive than Peacock's, with more granular control options.",
      "gapsIdentified": [
        "No screen time settings visible — confirms absence of native screen time features"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "17-viewing-restrictions.png": {
      "filename": "17-viewing-restrictions.png",
      "description": "Viewing restrictions page (top) showing maturity rating controls and title-specific blocking options. This is where maturity tiers are configured and individual titles can be blocked per profile.",
      "phosraRelevance": "Core page for setContentRestrictions() and setTitleRestrictions() adapter methods. Maturity tier selection and per-title blocking are configured here. Behind MFA gate.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + MFA verification",
        "notes": "Must complete MFA before accessing write controls. Maturity slider and title search/block interface require Playwright interaction.",
        "technicalDetails": "Select maturity tier via slider/radio buttons, add title restrictions via search input. Save changes via form submission."
      },
      "findings": [
        {
          "label": "4 maturity tiers",
          "detail": "Little Kids, Older Kids, Teens, All Maturity Ratings — maps to MPAA and TV ratings",
          "severity": "critical"
        },
        {
          "label": "Per-title blocking",
          "detail": "Individual titles can be searched and added to block list",
          "severity": "important"
        },
        {
          "label": "Behind MFA",
          "detail": "All changes on this page require prior MFA verification",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear maturity tier selection with descriptive labels. Title blocking interface uses search-based input."
      },
      "securityNotes": [
        "MFA required — prevents children from self-modifying restrictions"
      ],
      "apiIndicators": [
        "/api/shakti/*/maturityRestrictions for reads",
        "/api/shakti/*/titleRestrictions for title block list"
      ],
      "comparisonNotes": "Netflix's 4-tier maturity system is more granular than Peacock's binary kids/non-kids model. Netflix also offers per-title blocking which Peacock lacks.",
      "gapsIdentified": [],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "18-viewing-restrictions-scrolled.png": {
      "filename": "18-viewing-restrictions-scrolled.png",
      "description": "Viewing restrictions page (scrolled) showing maturity rating controls and title-specific blocking options. This is where maturity tiers are configured and individual titles can be blocked per profile.",
      "phosraRelevance": "Core page for setContentRestrictions() and setTitleRestrictions() adapter methods. Maturity tier selection and per-title blocking are configured here. Behind MFA gate.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + MFA verification",
        "notes": "Must complete MFA before accessing write controls. Maturity slider and title search/block interface require Playwright interaction.",
        "technicalDetails": "Select maturity tier via slider/radio buttons, add title restrictions via search input. Save changes via form submission."
      },
      "findings": [
        {
          "label": "4 maturity tiers",
          "detail": "Little Kids, Older Kids, Teens, All Maturity Ratings — maps to MPAA and TV ratings",
          "severity": "critical"
        },
        {
          "label": "Per-title blocking",
          "detail": "Individual titles can be searched and added to block list",
          "severity": "important"
        },
        {
          "label": "Behind MFA",
          "detail": "All changes on this page require prior MFA verification",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear maturity tier selection with descriptive labels. Title blocking interface uses search-based input."
      },
      "securityNotes": [
        "MFA required — prevents children from self-modifying restrictions"
      ],
      "apiIndicators": [
        "/api/shakti/*/maturityRestrictions for reads",
        "/api/shakti/*/titleRestrictions for title block list"
      ],
      "comparisonNotes": "Netflix's 4-tier maturity system is more granular than Peacock's binary kids/non-kids model. Netflix also offers per-title blocking which Peacock lacks.",
      "gapsIdentified": [],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "19-pin.png": {
      "filename": "19-pin.png",
      "description": "Profile PIN settings page (top) for Ramsay! profile showing 'Manage profile and preferences' with Profile Lock and Adjust Parental Controls options. Same settings hub as parental controls pages.",
      "phosraRelevance": "Navigation path to Profile Lock (PIN) settings. The Profile Lock link leads to the PIN creation/management page. Critical for Phosra's lockProfile/unlockProfile methods.",
      "relatedRuleCategories": [
        "profile_lock"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation",
        "notes": "Navigate to Profile Lock from settings hub. PIN creation requires password re-entry (not full MFA).",
        "technicalDetails": "await page.click('text=Profile Lock');"
      },
      "findings": [
        {
          "label": "Profile Lock accessible",
          "detail": "Profile Lock is prominently listed in the settings hub",
          "severity": "important"
        },
        {
          "label": "PIN is per-profile",
          "detail": "Each profile can have its own independent 4-digit PIN",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear settings layout with Profile Lock as a top-level option."
      },
      "securityNotes": [
        "PIN management requires password verification"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls/pin endpoint for PIN operations"
      ],
      "comparisonNotes": "Both Netflix and Peacock offer profile PIN locks with similar 4-digit format.",
      "gapsIdentified": [],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "20-pin-scrolled.png": {
      "filename": "20-pin-scrolled.png",
      "description": "Profile PIN settings page (scrolled) for Ramsay! profile showing 'Manage profile and preferences' with Profile Lock and Adjust Parental Controls options. Same settings hub as parental controls pages.",
      "phosraRelevance": "Navigation path to Profile Lock (PIN) settings. The Profile Lock link leads to the PIN creation/management page. Critical for Phosra's lockProfile/unlockProfile methods.",
      "relatedRuleCategories": [
        "profile_lock"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation",
        "notes": "Navigate to Profile Lock from settings hub. PIN creation requires password re-entry (not full MFA).",
        "technicalDetails": "await page.click('text=Profile Lock');"
      },
      "findings": [
        {
          "label": "Profile Lock accessible",
          "detail": "Profile Lock is prominently listed in the settings hub",
          "severity": "important"
        },
        {
          "label": "PIN is per-profile",
          "detail": "Each profile can have its own independent 4-digit PIN",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear settings layout with Profile Lock as a top-level option."
      },
      "securityNotes": [
        "PIN management requires password verification"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls/pin endpoint for PIN operations"
      ],
      "comparisonNotes": "Both Netflix and Peacock offer profile PIN locks with similar 4-digit format.",
      "gapsIdentified": [],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "21-viewing-activity.png": {
      "filename": "21-viewing-activity.png",
      "description": "Viewing activity page (top) showing watch history for a profile. Displays title names, dates watched, and episode details in chronological order.",
      "phosraRelevance": "Data source for getWatchHistory() adapter method. Shows title + date + episode data available per profile. Critical for Phosra's screen time monitoring (polling viewing history to estimate watch time).",
      "relatedRuleCategories": [
        "viewing_history_access",
        "screen_time_limit"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Shakti API or Playwright scrape",
        "notes": "Viewing activity readable via /api/shakti/*/viewingactivity without MFA. Playwright fallback for scraping if API changes.",
        "technicalDetails": "GET /api/shakti/*/viewingactivity with session cookies and profile GUID header."
      },
      "findings": [
        {
          "label": "Title + date data",
          "detail": "Each entry shows title name, date, and episode/season info",
          "severity": "important"
        },
        {
          "label": "No duration data",
          "detail": "Watch duration per session is NOT available — only title and date",
          "severity": "critical"
        },
        {
          "label": "Per-profile isolation",
          "detail": "Each profile has separate viewing activity — no cross-profile view",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clean tabular layout with date, title, and action columns."
      },
      "securityNotes": [
        "Viewing history can be hidden/deleted by the user, which would affect Phosra monitoring"
      ],
      "apiIndicators": [
        "/api/shakti/*/viewingactivity endpoint for programmatic access"
      ],
      "comparisonNotes": "Netflix viewing history is more detailed than Peacock's with per-episode tracking and CSV export. Neither provides duration data.",
      "gapsIdentified": [
        "No watch duration data limits screen time monitoring accuracy",
        "~30 min polling delay means potential overshoot of time limits"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "22-viewing-activity-scrolled.png": {
      "filename": "22-viewing-activity-scrolled.png",
      "description": "Viewing activity page (scrolled) showing watch history for a profile. Displays title names, dates watched, and episode details in chronological order.",
      "phosraRelevance": "Data source for getWatchHistory() adapter method. Shows title + date + episode data available per profile. Critical for Phosra's screen time monitoring (polling viewing history to estimate watch time).",
      "relatedRuleCategories": [
        "viewing_history_access",
        "screen_time_limit"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Shakti API or Playwright scrape",
        "notes": "Viewing activity readable via /api/shakti/*/viewingactivity without MFA. Playwright fallback for scraping if API changes.",
        "technicalDetails": "GET /api/shakti/*/viewingactivity with session cookies and profile GUID header."
      },
      "findings": [
        {
          "label": "Title + date data",
          "detail": "Each entry shows title name, date, and episode/season info",
          "severity": "important"
        },
        {
          "label": "No duration data",
          "detail": "Watch duration per session is NOT available — only title and date",
          "severity": "critical"
        },
        {
          "label": "Per-profile isolation",
          "detail": "Each profile has separate viewing activity — no cross-profile view",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clean tabular layout with date, title, and action columns."
      },
      "securityNotes": [
        "Viewing history can be hidden/deleted by the user, which would affect Phosra monitoring"
      ],
      "apiIndicators": [
        "/api/shakti/*/viewingactivity endpoint for programmatic access"
      ],
      "comparisonNotes": "Netflix viewing history is more detailed than Peacock's with per-episode tracking and CSV export. Neither provides duration data.",
      "gapsIdentified": [
        "No watch duration data limits screen time monitoring accuracy",
        "~30 min polling delay means potential overshoot of time limits"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "23-YourAccount.png": {
      "filename": "23-YourAccount.png",
      "description": "Your Account page (top) showing account management options and settings navigation.",
      "phosraRelevance": "Account management hub showing navigation to various settings sections. Alternative path to parental controls and profile management.",
      "relatedRuleCategories": [
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation",
        "notes": "Account page provides links to all settings sections.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account');"
      },
      "findings": [
        {
          "label": "Account navigation",
          "detail": "Shows sidebar navigation with Overview, Membership, Security, Devices, Profiles sections",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard account settings page layout."
      },
      "securityNotes": [],
      "apiIndicators": [
        "Account page accessible with session cookies only"
      ],
      "comparisonNotes": "Standard account management page, similar structure to Peacock's account settings.",
      "gapsIdentified": [],
      "relevance": "low",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "24-YourAccount-scrolled.png": {
      "filename": "24-YourAccount-scrolled.png",
      "description": "Your Account page (scrolled) showing account management options and settings navigation.",
      "phosraRelevance": "Account management hub showing navigation to various settings sections. Alternative path to parental controls and profile management.",
      "relatedRuleCategories": [
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation",
        "notes": "Account page provides links to all settings sections.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account');"
      },
      "findings": [
        {
          "label": "Account navigation",
          "detail": "Shows sidebar navigation with Overview, Membership, Security, Devices, Profiles sections",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard account settings page layout."
      },
      "securityNotes": [],
      "apiIndicators": [
        "Account page accessible with session cookies only"
      ],
      "comparisonNotes": "Standard account management page, similar structure to Peacock's account settings.",
      "gapsIdentified": [],
      "relevance": "low",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "25-manage.png": {
      "filename": "25-manage.png",
      "description": "Manage Profiles interface showing all 5 profiles in edit mode with pencil icons for editing each profile.",
      "phosraRelevance": "Profile management entry point for createKidsProfile() and profile editing. Shows all profiles available for configuration.",
      "relatedRuleCategories": [
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright interaction",
        "notes": "Click on profile to edit, or Add Profile to create new. Max 5 profiles limit applies.",
        "technicalDetails": "await page.goto('https://www.netflix.com/ManageProfiles');"
      },
      "findings": [
        {
          "label": "All profiles editable",
          "detail": "Edit icons visible on all 5 profiles",
          "severity": "informational"
        },
        {
          "label": "Max 5 reached",
          "detail": "No Add Profile option visible if at maximum capacity",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Grid layout with profile avatars and edit overlays."
      },
      "securityNotes": [],
      "apiIndicators": [],
      "comparisonNotes": "Similar to Peacock's profile management grid.",
      "gapsIdentified": [
        "Cannot create additional profiles when at 5/5 capacity"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "26-profiles-manage.png": {
      "filename": "26-profiles-manage.png",
      "description": "Manage Profiles interface showing all 5 profiles in edit mode with pencil icons for editing each profile.",
      "phosraRelevance": "Profile management entry point for createKidsProfile() and profile editing. Shows all profiles available for configuration.",
      "relatedRuleCategories": [
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright interaction",
        "notes": "Click on profile to edit, or Add Profile to create new. Max 5 profiles limit applies.",
        "technicalDetails": "await page.goto('https://www.netflix.com/ManageProfiles');"
      },
      "findings": [
        {
          "label": "All profiles editable",
          "detail": "Edit icons visible on all 5 profiles",
          "severity": "informational"
        },
        {
          "label": "Max 5 reached",
          "detail": "No Add Profile option visible if at maximum capacity",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Grid layout with profile avatars and edit overlays."
      },
      "securityNotes": [],
      "apiIndicators": [],
      "comparisonNotes": "Similar to Peacock's profile management grid.",
      "gapsIdentified": [
        "Cannot create additional profiles when at 5/5 capacity"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "27-profile-0-edit.png": {
      "filename": "27-profile-0-edit.png",
      "description": "Profile edit page (top section) for profile 0 (Ramsay!). Shows editable fields including name, avatar, language, game handle.",
      "phosraRelevance": "Profile configuration interface for standard profile. Used by createKidsProfile() and getProfileSettings().",
      "relatedRuleCategories": [
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright form interaction",
        "notes": "Profile fields editable via standard form inputs. Kids toggle converts profile type.",
        "technicalDetails": "Standard form fill and submit via Playwright."
      },
      "findings": [
        {
          "label": "Standard profile type",
          "detail": "Profile 'Ramsay!' configured as standard",
          "severity": "informational"
        },
        {
          "label": "Editable fields visible",
          "detail": "Name, avatar, language, and type-specific settings shown",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard Netflix profile edit form layout."
      },
      "securityNotes": [],
      "apiIndicators": [
        "Profile data readable via Falcor API without modification"
      ],
      "comparisonNotes": "Standard profile edit similar to Peacock.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "28-profile-0-edit-bottom.png": {
      "filename": "28-profile-0-edit-bottom.png",
      "description": "Profile edit page (bottom section) for profile 0 (Ramsay!). Shows editable fields including name, avatar, language, game handle.",
      "phosraRelevance": "Profile configuration interface for standard profile. Used by createKidsProfile() and getProfileSettings().",
      "relatedRuleCategories": [
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright form interaction",
        "notes": "Profile fields editable via standard form inputs. Kids toggle converts profile type.",
        "technicalDetails": "Standard form fill and submit via Playwright."
      },
      "findings": [
        {
          "label": "Standard profile type",
          "detail": "Profile 'Ramsay!' configured as standard",
          "severity": "informational"
        },
        {
          "label": "Editable fields visible",
          "detail": "Name, avatar, language, and type-specific settings shown",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard Netflix profile edit form layout."
      },
      "securityNotes": [],
      "apiIndicators": [
        "Profile data readable via Falcor API without modification"
      ],
      "comparisonNotes": "Standard profile edit similar to Peacock.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "29-profile-1-edit.png": {
      "filename": "29-profile-1-edit.png",
      "description": "Profile edit page (top section) for profile 1 (Mom and dad). Shows editable fields including name, avatar, language, game handle.",
      "phosraRelevance": "Profile configuration interface for standard profile. Used by createKidsProfile() and getProfileSettings().",
      "relatedRuleCategories": [
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright form interaction",
        "notes": "Profile fields editable via standard form inputs. Kids toggle converts profile type.",
        "technicalDetails": "Standard form fill and submit via Playwright."
      },
      "findings": [
        {
          "label": "Standard profile type",
          "detail": "Profile 'Mom and dad' configured as standard",
          "severity": "informational"
        },
        {
          "label": "Editable fields visible",
          "detail": "Name, avatar, language, and type-specific settings shown",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard Netflix profile edit form layout."
      },
      "securityNotes": [],
      "apiIndicators": [
        "Profile data readable via Falcor API without modification"
      ],
      "comparisonNotes": "Standard profile edit similar to Peacock.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "30-profile-1-edit-bottom.png": {
      "filename": "30-profile-1-edit-bottom.png",
      "description": "Profile edit page (bottom section) for profile 1 (Mom and dad). Shows editable fields including name, avatar, language, game handle.",
      "phosraRelevance": "Profile configuration interface for standard profile. Used by createKidsProfile() and getProfileSettings().",
      "relatedRuleCategories": [
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright form interaction",
        "notes": "Profile fields editable via standard form inputs. Kids toggle converts profile type.",
        "technicalDetails": "Standard form fill and submit via Playwright."
      },
      "findings": [
        {
          "label": "Standard profile type",
          "detail": "Profile 'Mom and dad' configured as standard",
          "severity": "informational"
        },
        {
          "label": "Editable fields visible",
          "detail": "Name, avatar, language, and type-specific settings shown",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard Netflix profile edit form layout."
      },
      "securityNotes": [],
      "apiIndicators": [
        "Profile data readable via Falcor API without modification"
      ],
      "comparisonNotes": "Standard profile edit similar to Peacock.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "31-profile-2-edit.png": {
      "filename": "31-profile-2-edit.png",
      "description": "Profile edit page (top section) for profile 2 (Samson). Shows editable fields including name, avatar, language, game handle, and Kids toggle.",
      "phosraRelevance": "Profile configuration interface for Kids profile. Used by createKidsProfile() and getProfileSettings().",
      "relatedRuleCategories": [
        "kids_profile",
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright form interaction",
        "notes": "Profile fields editable via standard form inputs. Kids toggle converts profile type.",
        "technicalDetails": "Standard form fill and submit via Playwright."
      },
      "findings": [
        {
          "label": "Kids profile type",
          "detail": "Profile 'Samson' configured as kids",
          "severity": "informational"
        },
        {
          "label": "Editable fields visible",
          "detail": "Name, avatar, language, and type-specific settings shown",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard Netflix profile edit form layout."
      },
      "securityNotes": [],
      "apiIndicators": [
        "Profile data readable via Falcor API without modification"
      ],
      "comparisonNotes": "Kids profile edit is more restricted than standard.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "32-profile-2-edit-bottom.png": {
      "filename": "32-profile-2-edit-bottom.png",
      "description": "Profile edit page (bottom section) for profile 2 (Samson). Shows editable fields including name, avatar, language, game handle, and Kids toggle.",
      "phosraRelevance": "Profile configuration interface for Kids profile. Used by createKidsProfile() and getProfileSettings().",
      "relatedRuleCategories": [
        "kids_profile",
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright form interaction",
        "notes": "Profile fields editable via standard form inputs. Kids toggle converts profile type.",
        "technicalDetails": "Standard form fill and submit via Playwright."
      },
      "findings": [
        {
          "label": "Kids profile type",
          "detail": "Profile 'Samson' configured as kids",
          "severity": "informational"
        },
        {
          "label": "Editable fields visible",
          "detail": "Name, avatar, language, and type-specific settings shown",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard Netflix profile edit form layout."
      },
      "securityNotes": [],
      "apiIndicators": [
        "Profile data readable via Falcor API without modification"
      ],
      "comparisonNotes": "Kids profile edit is more restricted than standard.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "33-profile-3-edit.png": {
      "filename": "33-profile-3-edit.png",
      "description": "Profile edit page (top section) for profile 3 (Chap). Shows editable fields including name, avatar, language, game handle, and Kids toggle.",
      "phosraRelevance": "Profile configuration interface for Kids profile. Used by createKidsProfile() and getProfileSettings().",
      "relatedRuleCategories": [
        "kids_profile",
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright form interaction",
        "notes": "Profile fields editable via standard form inputs. Kids toggle converts profile type.",
        "technicalDetails": "Standard form fill and submit via Playwright."
      },
      "findings": [
        {
          "label": "Kids profile type",
          "detail": "Profile 'Chap' configured as kids",
          "severity": "informational"
        },
        {
          "label": "Editable fields visible",
          "detail": "Name, avatar, language, and type-specific settings shown",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard Netflix profile edit form layout."
      },
      "securityNotes": [],
      "apiIndicators": [
        "Profile data readable via Falcor API without modification"
      ],
      "comparisonNotes": "Kids profile edit is more restricted than standard.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "34-profile-3-edit-bottom.png": {
      "filename": "34-profile-3-edit-bottom.png",
      "description": "Profile edit page (bottom section) for profile 3 (Chap). Shows editable fields including name, avatar, language, game handle, and Kids toggle.",
      "phosraRelevance": "Profile configuration interface for Kids profile. Used by createKidsProfile() and getProfileSettings().",
      "relatedRuleCategories": [
        "kids_profile",
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright form interaction",
        "notes": "Profile fields editable via standard form inputs. Kids toggle converts profile type.",
        "technicalDetails": "Standard form fill and submit via Playwright."
      },
      "findings": [
        {
          "label": "Kids profile type",
          "detail": "Profile 'Chap' configured as kids",
          "severity": "informational"
        },
        {
          "label": "Editable fields visible",
          "detail": "Name, avatar, language, and type-specific settings shown",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard Netflix profile edit form layout."
      },
      "securityNotes": [],
      "apiIndicators": [
        "Profile data readable via Falcor API without modification"
      ],
      "comparisonNotes": "Kids profile edit is more restricted than standard.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "35-profile-4-edit.png": {
      "filename": "35-profile-4-edit.png",
      "description": "Profile edit page (top section) for profile 4 (BANANA!!!!!!!!). Shows editable fields including name, avatar, language, game handle, and Kids toggle.",
      "phosraRelevance": "Profile configuration interface for Kids profile. Used by createKidsProfile() and getProfileSettings().",
      "relatedRuleCategories": [
        "kids_profile",
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright form interaction",
        "notes": "Profile fields editable via standard form inputs. Kids toggle converts profile type.",
        "technicalDetails": "Standard form fill and submit via Playwright."
      },
      "findings": [
        {
          "label": "Kids profile type",
          "detail": "Profile 'BANANA!!!!!!!!' configured as kids",
          "severity": "informational"
        },
        {
          "label": "Editable fields visible",
          "detail": "Name, avatar, language, and type-specific settings shown",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard Netflix profile edit form layout."
      },
      "securityNotes": [],
      "apiIndicators": [
        "Profile data readable via Falcor API without modification"
      ],
      "comparisonNotes": "Kids profile edit is more restricted than standard.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "36-profile-4-edit-bottom.png": {
      "filename": "36-profile-4-edit-bottom.png",
      "description": "Profile edit page (bottom section) for profile 4 (BANANA!!!!!!!!). Shows editable fields including name, avatar, language, game handle, and Kids toggle.",
      "phosraRelevance": "Profile configuration interface for Kids profile. Used by createKidsProfile() and getProfileSettings().",
      "relatedRuleCategories": [
        "kids_profile",
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright form interaction",
        "notes": "Profile fields editable via standard form inputs. Kids toggle converts profile type.",
        "technicalDetails": "Standard form fill and submit via Playwright."
      },
      "findings": [
        {
          "label": "Kids profile type",
          "detail": "Profile 'BANANA!!!!!!!!' configured as kids",
          "severity": "informational"
        },
        {
          "label": "Editable fields visible",
          "detail": "Name, avatar, language, and type-specific settings shown",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard Netflix profile edit form layout."
      },
      "securityNotes": [],
      "apiIndicators": [
        "Profile data readable via Falcor API without modification"
      ],
      "comparisonNotes": "Kids profile edit is more restricted than standard.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "37-profile-5-edit.png": {
      "filename": "37-profile-5-edit.png",
      "description": "Profile edit page (top section) for profile 5 (Profile 5 (add new)). Shows editable fields including name, avatar, language, game handle.",
      "phosraRelevance": "Profile configuration interface for standard profile. Used by createKidsProfile() and getProfileSettings().",
      "relatedRuleCategories": [
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright form interaction",
        "notes": "Profile fields editable via standard form inputs. Kids toggle converts profile type.",
        "technicalDetails": "Standard form fill and submit via Playwright."
      },
      "findings": [
        {
          "label": "Standard profile type",
          "detail": "Profile 'Profile 5 (add new)' configured as standard",
          "severity": "informational"
        },
        {
          "label": "Editable fields visible",
          "detail": "Name, avatar, language, and type-specific settings shown",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard Netflix profile edit form layout."
      },
      "securityNotes": [],
      "apiIndicators": [
        "Profile data readable via Falcor API without modification"
      ],
      "comparisonNotes": "Standard profile edit similar to Peacock.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "38-profile-5-kids-toggle.png": {
      "filename": "38-profile-5-kids-toggle.png",
      "description": "Profile edit page showing the Kids toggle switch for profile 5. Toggle visible that converts a profile between standard and Kids mode.",
      "phosraRelevance": "Documents the Kids toggle mechanism used by createKidsProfile(). Toggling this switch restricts the profile to kids-appropriate content and enables the separate Kids browsing UI.",
      "relatedRuleCategories": [
        "kids_profile",
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright toggle interaction",
        "notes": "Kids toggle is a standard switch element. Toggling it changes the profile type and restricts maturity level.",
        "technicalDetails": "await page.click('[data-testid=\"kids-toggle\"]'); await page.click('button:has-text(\"Save\")');"
      },
      "findings": [
        {
          "label": "Kids toggle visible",
          "detail": "Toggle switch for converting profile to Kids mode is prominently displayed",
          "severity": "important"
        },
        {
          "label": "Immediate effect",
          "detail": "Toggling Kids mode immediately restricts content maturity level",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear toggle switch UI element for Kids mode."
      },
      "securityNotes": [
        "Kids mode cannot be reversed without account owner access"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's Kids toggle is simpler than Peacock's kids profile creation flow.",
      "gapsIdentified": [],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "39-profile-5-edit-bottom.png": {
      "filename": "39-profile-5-edit-bottom.png",
      "description": "Bottom section of profile 5 edit page showing save/cancel buttons and additional profile options.",
      "phosraRelevance": "Bottom of profile edit form showing action buttons for saving profile changes.",
      "relatedRuleCategories": [
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright button click",
        "notes": "Save button submits profile changes.",
        "technicalDetails": "await page.click('button:has-text(\"Save\")');"
      },
      "findings": [
        {
          "label": "Save/Cancel actions",
          "detail": "Standard form action buttons at bottom of edit page",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard form footer with action buttons."
      },
      "securityNotes": [],
      "apiIndicators": [],
      "comparisonNotes": "Standard save/cancel pattern common across streaming platforms.",
      "gapsIdentified": [],
      "relevance": "low",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "40-viewing-activity.png": {
      "filename": "40-viewing-activity.png",
      "description": "Viewing activity page (main) showing watch history entries with title, date, and episode information. Includes Show More pagination and Download all/Hide all options.",
      "phosraRelevance": "Additional viewing activity data for getWatchHistory(). Shows pagination and bulk action options (download, hide all).",
      "relatedRuleCategories": [
        "viewing_history_access",
        "screen_time_limit"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Shakti API or Playwright scrape",
        "notes": "Pagination via 'Show More' button for large histories. Download all exports CSV.",
        "technicalDetails": "/api/shakti/*/viewingactivity with pagination params"
      },
      "findings": [
        {
          "label": "Pagination available",
          "detail": "Show More button for loading additional history entries",
          "severity": "informational"
        },
        {
          "label": "Bulk actions",
          "detail": "Download all and Hide all options available",
          "severity": "informational"
        },
        {
          "label": "Report a problem link",
          "detail": "Each entry has a 'Report a problem' action",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Tabular viewing activity with clear date and title columns."
      },
      "securityNotes": [
        "Hide all permanently removes all viewing history — destructive action"
      ],
      "apiIndicators": [
        "/api/shakti/*/viewingactivity with pagination support"
      ],
      "comparisonNotes": "Netflix's CSV download is more useful than Peacock's viewing history for data export.",
      "gapsIdentified": [
        "No duration data in any viewing activity view"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "41-viewing-activity-bottom.png": {
      "filename": "41-viewing-activity-bottom.png",
      "description": "Viewing activity page (bottom) showing watch history entries with title, date, and episode information. Includes Show More pagination and Download all/Hide all options.",
      "phosraRelevance": "Additional viewing activity data for getWatchHistory(). Shows pagination and bulk action options (download, hide all).",
      "relatedRuleCategories": [
        "viewing_history_access",
        "screen_time_limit"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Shakti API or Playwright scrape",
        "notes": "Pagination via 'Show More' button for large histories. Download all exports CSV.",
        "technicalDetails": "/api/shakti/*/viewingactivity with pagination params"
      },
      "findings": [
        {
          "label": "Pagination available",
          "detail": "Show More button for loading additional history entries",
          "severity": "informational"
        },
        {
          "label": "Bulk actions",
          "detail": "Download all and Hide all options available",
          "severity": "informational"
        },
        {
          "label": "Report a problem link",
          "detail": "Each entry has a 'Report a problem' action",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Tabular viewing activity with clear date and title columns."
      },
      "securityNotes": [
        "Hide all permanently removes all viewing history — destructive action"
      ],
      "apiIndicators": [
        "/api/shakti/*/viewingactivity with pagination support"
      ],
      "comparisonNotes": "Netflix's CSV download is more useful than Peacock's viewing history for data export.",
      "gapsIdentified": [
        "No duration data in any viewing activity view"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "42-viewing-activity-alt.png": {
      "filename": "42-viewing-activity-alt.png",
      "description": "Viewing activity page (alternate view) showing watch history entries with title, date, and episode information. Includes Show More pagination and Download all/Hide all options.",
      "phosraRelevance": "Additional viewing activity data for getWatchHistory(). Shows pagination and bulk action options (download, hide all).",
      "relatedRuleCategories": [
        "viewing_history_access",
        "screen_time_limit"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Shakti API or Playwright scrape",
        "notes": "Pagination via 'Show More' button for large histories. Download all exports CSV.",
        "technicalDetails": "/api/shakti/*/viewingactivity with pagination params"
      },
      "findings": [
        {
          "label": "Pagination available",
          "detail": "Show More button for loading additional history entries",
          "severity": "informational"
        },
        {
          "label": "Bulk actions",
          "detail": "Download all and Hide all options available",
          "severity": "informational"
        },
        {
          "label": "Report a problem link",
          "detail": "Each entry has a 'Report a problem' action",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Tabular viewing activity with clear date and title columns."
      },
      "securityNotes": [
        "Hide all permanently removes all viewing history — destructive action"
      ],
      "apiIndicators": [
        "/api/shakti/*/viewingactivity with pagination support"
      ],
      "comparisonNotes": "Netflix's CSV download is more useful than Peacock's viewing history for data export.",
      "gapsIdentified": [
        "No duration data in any viewing activity view"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "43-browse-main.png": {
      "filename": "43-browse-main.png",
      "description": "Netflix main browse page showing the standard adult browsing experience with movie/show recommendations, Continue Watching row, and content carousel. Full Netflix header with search, notifications, and profile dropdown.",
      "phosraRelevance": "Shows the standard (non-kids) browsing interface. Not directly relevant to parental controls but documents the content experience that maturity restrictions filter.",
      "relatedRuleCategories": [
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "not_applicable",
        "method": "N/A — browse page is for content consumption, not settings",
        "notes": "Browse page not directly automated by Phosra. Content filtering is managed through maturity settings.",
        "technicalDetails": "N/A"
      },
      "findings": [
        {
          "label": "Adult content visible",
          "detail": "Standard browse shows all maturity ratings content when profile is set to All Maturity Ratings",
          "severity": "informational"
        },
        {
          "label": "Full navigation",
          "detail": "Header shows Home, Shows, Movies, New & Popular, My List, Browse by Language options",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "polished",
        "notes": "Netflix's signature dark theme browse experience with rich content imagery and smooth carousels."
      },
      "securityNotes": [],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's browse UI is more polished than Peacock's, with better content discovery features.",
      "gapsIdentified": [],
      "relevance": "low",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "44-profile-dropdown.png": {
      "filename": "44-profile-dropdown.png",
      "description": "Profile dropdown menu in the top-right corner showing options: Back to Netflix, Account, Manage Profiles, Help Center, Switch Profile, and Sign out. Visible during MFA verification flow.",
      "phosraRelevance": "Documents the profile dropdown navigation available during all Netflix sessions. Switch Profile and Account links are key navigation paths for Phosra.",
      "relatedRuleCategories": [
        "profile_lock"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright dropdown interaction",
        "notes": "Profile dropdown accessible from any Netflix page. Provides quick navigation to Account and profile switching.",
        "technicalDetails": "await page.click('[data-testid=\"profile-menu\"]'); await page.click('text=Account');"
      },
      "findings": [
        {
          "label": "Profile switching available",
          "detail": "Switch Profile option in dropdown for changing active profile",
          "severity": "informational"
        },
        {
          "label": "Account access",
          "detail": "Direct link to Account settings from any page",
          "severity": "informational"
        },
        {
          "label": "Sign out option",
          "detail": "Sign out available from dropdown — would invalidate session cookies",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard dropdown menu with clear navigation options."
      },
      "securityNotes": [
        "Sign out invalidates session cookies — Phosra must handle session management"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Similar profile dropdown to Peacock's account menu.",
      "gapsIdentified": [],
      "relevance": "low",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "45-kids-browse.png": {
      "filename": "45-kids-browse.png",
      "description": "Netflix Kids browsing experience (top section) showing child-appropriate content with colorful UI, character-based navigation, large thumbnails, and curated content rows including Shows, Continue Watching, Characters, 90-Minute Kids Movies, Today's Top Picks, Freshly Spun Fairy Tales, Top 10 Kids Movies. Features hero banner (Henry Danger) with Play and More Info buttons.",
      "phosraRelevance": "Documents the Kids profile browsing experience. This restricted UI is what children see when using a Kids profile. Content is limited to the profile's maturity tier. The distinct UI confirms that Kids profiles provide meaningful content isolation.",
      "relatedRuleCategories": [
        "kids_profile",
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "not_applicable",
        "method": "N/A — Kids browse is the content experience, not a settings interface",
        "notes": "Kids browse experience is a result of profile maturity settings. Not directly automated by Phosra.",
        "technicalDetails": "N/A"
      },
      "findings": [
        {
          "label": "Completely different UI",
          "detail": "Kids browse has distinct colorful design, simplified navigation, and character-based browsing rows",
          "severity": "important"
        },
        {
          "label": "Content restriction active",
          "detail": "Only age-appropriate content shown based on profile maturity tier",
          "severity": "critical"
        },
        {
          "label": "No settings access",
          "detail": "No way to access account settings, parental controls, or mature content from Kids UI",
          "severity": "important"
        },
        {
          "label": "Exit Kids button",
          "detail": "Small 'Exit Kids' link visible for switching back to standard profiles",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "polished",
        "notes": "Vibrant, engaging kids interface with large thumbnails, character icons, and curated age-appropriate rows. Industry-leading kids content experience."
      },
      "securityNotes": [
        "Kids UI provides no path to modify parental settings — security positive"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's Kids UI is significantly more polished and feature-rich than Peacock's kids experience, with character browsing, curated themed rows, and a fully distinct design language.",
      "gapsIdentified": [
        "No screen time indicators or usage warnings in Kids UI"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "46-kids-browse-mid.png": {
      "filename": "46-kids-browse-mid.png",
      "description": "Netflix Kids browsing experience (middle section) showing child-appropriate content with colorful UI, character-based navigation, large thumbnails, and curated content rows including Shows, Continue Watching, Characters, 90-Minute Kids Movies, Today's Top Picks, Freshly Spun Fairy Tales, Top 10 Kids Movies. Features hero banner (Henry Danger) with Play and More Info buttons.",
      "phosraRelevance": "Documents the Kids profile browsing experience. This restricted UI is what children see when using a Kids profile. Content is limited to the profile's maturity tier. The distinct UI confirms that Kids profiles provide meaningful content isolation.",
      "relatedRuleCategories": [
        "kids_profile",
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "not_applicable",
        "method": "N/A — Kids browse is the content experience, not a settings interface",
        "notes": "Kids browse experience is a result of profile maturity settings. Not directly automated by Phosra.",
        "technicalDetails": "N/A"
      },
      "findings": [
        {
          "label": "Completely different UI",
          "detail": "Kids browse has distinct colorful design, simplified navigation, and character-based browsing rows",
          "severity": "important"
        },
        {
          "label": "Content restriction active",
          "detail": "Only age-appropriate content shown based on profile maturity tier",
          "severity": "critical"
        },
        {
          "label": "No settings access",
          "detail": "No way to access account settings, parental controls, or mature content from Kids UI",
          "severity": "important"
        },
        {
          "label": "Exit Kids button",
          "detail": "Small 'Exit Kids' link visible for switching back to standard profiles",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "polished",
        "notes": "Vibrant, engaging kids interface with large thumbnails, character icons, and curated age-appropriate rows. Industry-leading kids content experience."
      },
      "securityNotes": [
        "Kids UI provides no path to modify parental settings — security positive"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's Kids UI is significantly more polished and feature-rich than Peacock's kids experience, with character browsing, curated themed rows, and a fully distinct design language.",
      "gapsIdentified": [
        "No screen time indicators or usage warnings in Kids UI"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "47-kids-browse-bottom.png": {
      "filename": "47-kids-browse-bottom.png",
      "description": "Netflix Kids browsing experience (bottom section) showing child-appropriate content with colorful UI, character-based navigation, large thumbnails, and curated content rows including Shows, Continue Watching, Characters, 90-Minute Kids Movies, Today's Top Picks, Freshly Spun Fairy Tales, Top 10 Kids Movies. Features hero banner (Henry Danger) with Play and More Info buttons.",
      "phosraRelevance": "Documents the Kids profile browsing experience. This restricted UI is what children see when using a Kids profile. Content is limited to the profile's maturity tier. The distinct UI confirms that Kids profiles provide meaningful content isolation.",
      "relatedRuleCategories": [
        "kids_profile",
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "not_applicable",
        "method": "N/A — Kids browse is the content experience, not a settings interface",
        "notes": "Kids browse experience is a result of profile maturity settings. Not directly automated by Phosra.",
        "technicalDetails": "N/A"
      },
      "findings": [
        {
          "label": "Completely different UI",
          "detail": "Kids browse has distinct colorful design, simplified navigation, and character-based browsing rows",
          "severity": "important"
        },
        {
          "label": "Content restriction active",
          "detail": "Only age-appropriate content shown based on profile maturity tier",
          "severity": "critical"
        },
        {
          "label": "No settings access",
          "detail": "No way to access account settings, parental controls, or mature content from Kids UI",
          "severity": "important"
        },
        {
          "label": "Exit Kids button",
          "detail": "Small 'Exit Kids' link visible for switching back to standard profiles",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "polished",
        "notes": "Vibrant, engaging kids interface with large thumbnails, character icons, and curated age-appropriate rows. Industry-leading kids content experience."
      },
      "securityNotes": [
        "Kids UI provides no path to modify parental settings — security positive"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's Kids UI is significantly more polished and feature-rich than Peacock's kids experience, with character browsing, curated themed rows, and a fully distinct design language.",
      "gapsIdentified": [
        "No screen time indicators or usage warnings in Kids UI"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "48-kids-direct.png": {
      "filename": "48-kids-direct.png",
      "description": "Direct navigation to Netflix Kids experience, possibly showing the Kids landing page or Kids-specific URL entry point.",
      "phosraRelevance": "Documents the direct Kids profile access path. Relevant for understanding how Kids profiles are accessed and isolated from standard profiles.",
      "relatedRuleCategories": [
        "kids_profile"
      ],
      "automation": {
        "feasibility": "not_applicable",
        "method": "N/A",
        "notes": "Direct Kids access is a read-only content experience.",
        "technicalDetails": "N/A"
      },
      "findings": [
        {
          "label": "Kids direct access",
          "detail": "Kids profiles accessible via direct navigation or profile picker",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Kids-specific entry point."
      },
      "securityNotes": [],
      "apiIndicators": [],
      "comparisonNotes": "Direct kids profile access similar to Peacock's kids mode.",
      "gapsIdentified": [],
      "relevance": "low",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "49-maturity-settings.png": {
      "filename": "49-maturity-settings.png",
      "description": "Manage profile and preferences page for Samson (Kids profile) showing reduced settings: Edit personal and contact info, Profile Lock, Languages, Adjust Parental Controls, Subtitle appearance, Playback settings, Viewing activity. Delete Profile button visible. Notably missing: Notification settings and Privacy and data settings (present on adult profiles).",
      "phosraRelevance": "Kids profile settings page showing reduced options compared to adult profiles. Confirms that Kids profiles have intentionally restricted settings access. Adjust Parental Controls and Profile Lock are still available.",
      "relatedRuleCategories": [
        "kids_profile",
        "content_rating_filter",
        "profile_lock"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation",
        "notes": "Kids profile settings accessible but with fewer options than adult profiles.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account/profile?guid=SAMSON_GUID');"
      },
      "findings": [
        {
          "label": "Reduced settings for Kids",
          "detail": "Kids profiles missing Notification settings and Privacy and data settings sections",
          "severity": "important"
        },
        {
          "label": "Parental controls still accessible",
          "detail": "Adjust Parental Controls link present on Kids profile settings",
          "severity": "important"
        },
        {
          "label": "Profile Lock available",
          "detail": "PIN lock can be set on Kids profiles too",
          "severity": "informational"
        },
        {
          "label": "Delete Profile option",
          "detail": "Kids profiles can be deleted (unlike primary profile)",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clean settings page with fewer options than adult profile version."
      },
      "securityNotes": [
        "Kids profiles have restricted settings access — security positive design"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix intentionally limits Kids profile settings. Peacock's approach is less differentiated between profile types.",
      "gapsIdentified": [],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "50-profile-lock.png": {
      "filename": "50-profile-lock.png",
      "description": "Create a Profile Lock page for Ramsay! showing explanation text: 'Make this profile private by adding a 4-digit PIN that will need to be entered to access it.' Large 'Create a Profile Lock' button. Note: 'You'll be asked to enter the account password when making changes to profile lock.'",
      "phosraRelevance": "PIN creation interface for setProfilePIN() adapter method. Shows the 4-digit PIN creation flow with password verification requirement. This is Phosra's primary mechanism for screen time enforcement — locking/unlocking profiles by managing PINs.",
      "relatedRuleCategories": [
        "profile_lock",
        "screen_time_limit"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + password re-entry",
        "notes": "Create Profile Lock button leads to PIN entry form. Account password re-entry required (not full MFA with email/SMS).",
        "technicalDetails": "await page.click('text=Create a Profile Lock'); // then enter 4-digit PIN and account password"
      },
      "findings": [
        {
          "label": "4-digit PIN format",
          "detail": "Profile Lock uses a 4-digit numeric PIN",
          "severity": "important"
        },
        {
          "label": "Password required",
          "detail": "Account password re-entry required when creating/changing PIN — simpler than full MFA",
          "severity": "critical"
        },
        {
          "label": "Per-profile isolation",
          "detail": "PIN is specific to this profile — other profiles unaffected",
          "severity": "important"
        },
        {
          "label": "Screen time mechanism",
          "detail": "Profile PIN lock/unlock is Phosra's primary screen time enforcement strategy for Netflix",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Simple, clear page with prominent action button and helpful explanation text."
      },
      "securityNotes": [
        "Password verification required but less complex than email/SMS MFA",
        "PIN prevents unauthorized profile switching"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls/pin for PIN management"
      ],
      "comparisonNotes": "Netflix's Profile Lock is similar to Peacock's but Netflix's password-only verification (not full MFA) makes it slightly easier to automate.",
      "gapsIdentified": [
        "Profile lock does not enforce time limits — only access control. Phosra adds time-based lock/unlock logic."
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "51-autoplay.png": {
      "filename": "51-autoplay.png",
      "description": "Playback settings page showing autoplay controls and data usage settings. Identical to deep-Ramsay-playback.png showing Autoplay next episode toggle (on), Autoplay previews toggle (on), and Data usage per screen options (Auto/Low/Medium/High).",
      "phosraRelevance": "Autoplay settings relevant for autoplay_control rule category. Disabling autoplay next episode is a Phosra strategy to reduce passive binge-watching. Data usage settings are informational.",
      "relatedRuleCategories": [
        "autoplay_control"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright toggle interaction",
        "notes": "Autoplay toggles are standard switch elements. No MFA required to change playback settings.",
        "technicalDetails": "await page.click('[data-testid=\"autoplay-next-episode-toggle\"]'); // toggle off to reduce passive viewing"
      },
      "findings": [
        {
          "label": "Autoplay next episode",
          "detail": "Toggle to auto-play next episode — ON by default, applies to all devices",
          "severity": "important"
        },
        {
          "label": "Autoplay previews",
          "detail": "Toggle to auto-play previews while browsing — ON by default",
          "severity": "informational"
        },
        {
          "label": "No MFA required",
          "detail": "Playback settings can be changed without MFA verification",
          "severity": "important"
        },
        {
          "label": "Data usage options",
          "detail": "Auto, Low (0.3GB/hr), Medium (0.7GB/hr), High (3-7GB/hr)",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Simple toggle and radio button interface for playback preferences."
      },
      "securityNotes": [
        "No additional authentication required for playback changes"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's autoplay controls are more granular than Peacock's. Both platforms default autoplay to ON.",
      "gapsIdentified": [
        "No screen time controls in playback settings — only autoplay and quality"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "52-ManageProfiles.png": {
      "filename": "52-ManageProfiles.png",
      "description": "Manage Profiles page showing all 5 profiles in management mode with edit capability.",
      "phosraRelevance": "Profile management interface for Playwright-based profile operations.",
      "relatedRuleCategories": [
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation",
        "notes": "Standard profile management grid.",
        "technicalDetails": "await page.goto('https://www.netflix.com/ManageProfiles');"
      },
      "findings": [
        {
          "label": "5 profiles visible",
          "detail": "All profiles shown in edit grid",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard profile management layout."
      },
      "securityNotes": [],
      "apiIndicators": [],
      "comparisonNotes": "Similar to other profile management screenshots.",
      "gapsIdentified": [],
      "relevance": "low",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "53-switchprofiles.png": {
      "filename": "53-switchprofiles.png",
      "description": "Profile switcher showing 'Who's watching?' with all 5 profiles. Same as profile picker but accessed via Switch Profile action.",
      "phosraRelevance": "Profile switching interface used during adapter operations to switch between profiles for per-profile data access.",
      "relatedRuleCategories": [
        "kids_profile",
        "profile_lock"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright or Falcor API profile switch",
        "notes": "Profile switch available via UI or /nq/website/memberapi/release/profiles/switch API endpoint.",
        "technicalDetails": "POST /nq/website/memberapi/release/profiles/switch with profile GUID"
      },
      "findings": [
        {
          "label": "Lock icon visible",
          "detail": "Mom and dad profile shows lock icon — PIN required to access",
          "severity": "important"
        },
        {
          "label": "Kids badges",
          "detail": "Kids profiles clearly marked with red badges",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard profile picker layout, same as post-login profile picker."
      },
      "securityNotes": [
        "Locked profiles require PIN entry to access"
      ],
      "apiIndicators": [
        "/nq/website/memberapi/release/profiles/switch for programmatic profile switching"
      ],
      "comparisonNotes": "Profile switching similar to Peacock's profile selector.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "54-account-all-expanded.png": {
      "filename": "54-account-all-expanded.png",
      "description": "Account page with all sections expanded showing complete account details, membership info, and all quick links visible at once.",
      "phosraRelevance": "Full account overview for understanding all available settings and navigation paths.",
      "relatedRuleCategories": [
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation",
        "notes": "Expanded view of all account settings sections.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account');"
      },
      "findings": [
        {
          "label": "All sections visible",
          "detail": "Complete account overview with all settings expanded",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Comprehensive account overview with all sections accessible."
      },
      "securityNotes": [],
      "apiIndicators": [
        "Account data accessible with session cookies only"
      ],
      "comparisonNotes": "More comprehensive than Peacock's account page.",
      "gapsIdentified": [],
      "relevance": "low",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-account-profiles.png": {
      "filename": "deep-account-profiles.png",
      "description": "Account > Profiles section (top) showing the profiles management area within the account settings sidebar navigation. Lists all profiles with maturity ratings and 'Your Profile' indicator on the account owner's profile.",
      "phosraRelevance": "Profiles section in account settings showing per-profile maturity levels (e.g., 'TV-PG PG and below' for kids profiles, 'All maturity ratings' for adults). Profile selector modal visible with all profiles listed.",
      "relatedRuleCategories": [
        "kids_profile",
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Falcor API or Playwright",
        "notes": "Profile list with maturity levels readable via API. This view confirms maturity tier assignments per profile.",
        "technicalDetails": "Falcor path query for profile details including maturity level."
      },
      "findings": [
        {
          "label": "Maturity levels shown",
          "detail": "Each profile's maturity level displayed (e.g., TV-PG PG and below for kids)",
          "severity": "important"
        },
        {
          "label": "Profile selector modal",
          "detail": "Modal overlay for selecting which profile to manage",
          "severity": "informational"
        },
        {
          "label": "Your Profile indicator",
          "detail": "Account owner's profile marked with 'Your Profile' badge",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clean modal overlay with profile list and maturity level info."
      },
      "securityNotes": [],
      "apiIndicators": [
        "Profile maturity data available via Falcor API"
      ],
      "comparisonNotes": "Netflix shows maturity levels inline in profile selector. Peacock's profile selector is simpler.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-account-profiles-bottom.png": {
      "filename": "deep-account-profiles-bottom.png",
      "description": "Account > Profiles section (bottom) showing the profiles management area within the account settings sidebar navigation. Lists all profiles with maturity ratings and 'Your Profile' indicator on the account owner's profile.",
      "phosraRelevance": "Profiles section in account settings showing per-profile maturity levels (e.g., 'TV-PG PG and below' for kids profiles, 'All maturity ratings' for adults). Profile selector modal visible with all profiles listed.",
      "relatedRuleCategories": [
        "kids_profile",
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Falcor API or Playwright",
        "notes": "Profile list with maturity levels readable via API. This view confirms maturity tier assignments per profile.",
        "technicalDetails": "Falcor path query for profile details including maturity level."
      },
      "findings": [
        {
          "label": "Maturity levels shown",
          "detail": "Each profile's maturity level displayed (e.g., TV-PG PG and below for kids)",
          "severity": "important"
        },
        {
          "label": "Profile selector modal",
          "detail": "Modal overlay for selecting which profile to manage",
          "severity": "informational"
        },
        {
          "label": "Your Profile indicator",
          "detail": "Account owner's profile marked with 'Your Profile' badge",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clean modal overlay with profile list and maturity level info."
      },
      "securityNotes": [],
      "apiIndicators": [
        "Profile maturity data available via Falcor API"
      ],
      "comparisonNotes": "Netflix shows maturity levels inline in profile selector. Peacock's profile selector is simpler.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-account-security.png": {
      "filename": "deep-account-security.png",
      "description": "Account > Security section (top) showing Account Details with Password, Email (jake.k.klinvex@gmail.com, Verified), Mobile phone ((412) 566-7932). Access and Privacy section shows Access and devices, Profile Transfer (Off, New), Personal info access, Feature testing (On). Delete Account button at bottom.",
      "phosraRelevance": "Security settings relevant for understanding MFA verification methods. Email and phone number shown here are the same used for MFA code delivery. Profile Transfer and device management provide additional account security context.",
      "relatedRuleCategories": [
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation",
        "notes": "Security page shows MFA contact methods. Password, email, and phone are used for MFA verification.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account/security');"
      },
      "findings": [
        {
          "label": "MFA contact methods visible",
          "detail": "Email (verified) and phone number shown — these receive MFA codes",
          "severity": "important"
        },
        {
          "label": "Profile Transfer feature",
          "detail": "Profile Transfer currently Off, with 'New' badge — Kids profiles cannot be transferred",
          "severity": "informational"
        },
        {
          "label": "Device management",
          "detail": "Access and devices section for managing signed-in devices",
          "severity": "informational"
        },
        {
          "label": "Delete Account option",
          "detail": "Delete Account button visible at bottom of Security page",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Well-organized security page with clear section headers."
      },
      "securityNotes": [
        "Email and phone number visible — used for MFA delivery",
        "Delete Account is a destructive action that should never be automated"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's security page is more comprehensive than Peacock's, with explicit MFA method visibility.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-account-security-bottom.png": {
      "filename": "deep-account-security-bottom.png",
      "description": "Account > Security section (bottom) showing Account Details with Password, Email (jake.k.klinvex@gmail.com, Verified), Mobile phone ((412) 566-7932). Access and Privacy section shows Access and devices, Profile Transfer (Off, New), Personal info access, Feature testing (On). Delete Account button at bottom.",
      "phosraRelevance": "Security settings relevant for understanding MFA verification methods. Email and phone number shown here are the same used for MFA code delivery. Profile Transfer and device management provide additional account security context.",
      "relatedRuleCategories": [
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation",
        "notes": "Security page shows MFA contact methods. Password, email, and phone are used for MFA verification.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account/security');"
      },
      "findings": [
        {
          "label": "MFA contact methods visible",
          "detail": "Email (verified) and phone number shown — these receive MFA codes",
          "severity": "important"
        },
        {
          "label": "Profile Transfer feature",
          "detail": "Profile Transfer currently Off, with 'New' badge — Kids profiles cannot be transferred",
          "severity": "informational"
        },
        {
          "label": "Device management",
          "detail": "Access and devices section for managing signed-in devices",
          "severity": "informational"
        },
        {
          "label": "Delete Account option",
          "detail": "Delete Account button visible at bottom of Security page",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Well-organized security page with clear section headers."
      },
      "securityNotes": [
        "Email and phone number visible — used for MFA delivery",
        "Delete Account is a destructive action that should never be automated"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's security page is more comprehensive than Peacock's, with explicit MFA method visibility.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-manage-devices.png": {
      "filename": "deep-manage-devices.png",
      "description": "Account > Devices section showing 'Access and devices' (Manage signed-in devices) and 'Mobile Downloads' (Using 4 of 6 download devices). Two main cards in the Devices management area.",
      "phosraRelevance": "Device management page showing signed-in devices and download device allocation. Relevant for understanding Netflix's device tracking which may affect automation detection.",
      "relatedRuleCategories": [],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation",
        "notes": "Device page shows active devices. Phosra's Playwright sessions may appear as additional devices.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account/devices');"
      },
      "findings": [
        {
          "label": "Device tracking active",
          "detail": "Netflix tracks signed-in devices and download devices separately",
          "severity": "important"
        },
        {
          "label": "4 of 6 download devices",
          "detail": "Download device allocation visible — Premium plan allows 6 devices",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Simple device management layout with two main sections."
      },
      "securityNotes": [
        "Automated Playwright sessions may be tracked as additional devices",
        "Manage signed-in devices could reveal Phosra's automation"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Device management is more transparent than Peacock's. Both platforms track signed-in devices.",
      "gapsIdentified": [
        "Phosra automation sessions may appear as unknown devices in user's device list"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-transfer-profile.png": {
      "filename": "deep-transfer-profile.png",
      "description": "Profile Transfer page asking 'Do you want to allow profile transfers?' with explanation about transferring profiles including recommendations, viewing history, My List, saved games, and settings to another membership. Notes that Kids profiles cannot be transferred and payment info is never transferred. Allow and Go Back to Home buttons.",
      "phosraRelevance": "Profile Transfer feature documentation. Key finding: Kids profiles cannot be transferred, which is a security-positive design for child account protection.",
      "relatedRuleCategories": [
        "kids_profile"
      ],
      "automation": {
        "feasibility": "not_applicable",
        "method": "N/A — Profile Transfer is not part of Phosra's automation scope",
        "notes": "Profile Transfer is a one-time migration feature, not relevant to ongoing parental controls.",
        "technicalDetails": "N/A"
      },
      "findings": [
        {
          "label": "Kids profiles non-transferable",
          "detail": "Kids profiles explicitly cannot be transferred to another account — security positive for child protection",
          "severity": "important"
        },
        {
          "label": "Data portability",
          "detail": "Viewing history, recommendations, My List, saved games transferable",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "polished",
        "notes": "Visually appealing page with purple gradient and animated gift box illustration."
      },
      "securityNotes": [
        "Kids profile transfer restriction prevents unauthorized child account migration"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's Profile Transfer is unique — Peacock does not offer this feature. The Kids profile restriction is relevant for child safety.",
      "gapsIdentified": [],
      "relevance": "low",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Ramsay-settings.png": {
      "filename": "deep-Ramsay-settings.png",
      "description": "Manage profile and preferences page for Ramsay! (standard profile). Shows profile info, Profile Lock, and Preferences section with Languages, Adjust Parental Controls, Subtitle appearance, Playback settings, Notification settings, Viewing activity, Privacy and data settings. Delete Profile button disabled (primary profile).",
      "phosraRelevance": "Per-profile settings hub for Ramsay!. Standard profile with full settings access. Central navigation point for all Phosra per-profile operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "profile_lock",
        "autoplay_control",
        "viewing_history_access"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation to sub-settings",
        "notes": "Settings hub for Ramsay!. Each link navigates to dedicated settings page.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account/profile?guid=RAMSAY_GUID');"
      },
      "findings": [
        {
          "label": "Standard profile settings",
          "detail": "Ramsay! settings page with full options",
          "severity": "informational"
        },
        {
          "label": "Parental controls access",
          "detail": "Adjust Parental Controls link present for maturity and title restriction changes",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Full settings page with clear navigation options."
      },
      "securityNotes": [
        "Full settings access available"
      ],
      "apiIndicators": [
        "Settings page readable without MFA"
      ],
      "comparisonNotes": "Standard profile with full settings comparable to Peacock.",
      "gapsIdentified": [
        "No screen time settings on any profile type"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Ramsay-parental-controls.png": {
      "filename": "deep-Ramsay-parental-controls.png",
      "description": "Parental controls section (top) for Ramsay! profile showing maturity rating configuration and related settings. Adult profile with configurable maturity level.",
      "phosraRelevance": "Parental controls configuration for Ramsay!. Shows maturity tier (All Maturity Ratings) and navigation to viewing restrictions. Behind MFA for write operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + MFA for writes, Shakti API for reads",
        "notes": "Maturity level for Ramsay! is All Maturity Ratings. Changes require MFA verification.",
        "technicalDetails": "/api/shakti/*/parentalControls for reading Ramsay!'s maturity settings"
      },
      "findings": [
        {
          "label": "Maturity: All Maturity Ratings",
          "detail": "Ramsay! maturity level set to All Maturity Ratings",
          "severity": "informational"
        },
        {
          "label": "MFA gate for changes",
          "detail": "Any maturity level modification requires MFA verification",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard parental controls layout for Ramsay!."
      },
      "securityNotes": [
        "MFA required for any parental control modifications"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls",
        "/api/shakti/*/maturityRestrictions"
      ],
      "comparisonNotes": "Standard profile allows full maturity range.",
      "gapsIdentified": [],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Ramsay-parental-controls-mid.png": {
      "filename": "deep-Ramsay-parental-controls-mid.png",
      "description": "Parental controls section (middle) for Ramsay! profile showing maturity rating configuration and related settings. Adult profile with configurable maturity level.",
      "phosraRelevance": "Parental controls configuration for Ramsay!. Shows maturity tier (All Maturity Ratings) and navigation to viewing restrictions. Behind MFA for write operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + MFA for writes, Shakti API for reads",
        "notes": "Maturity level for Ramsay! is All Maturity Ratings. Changes require MFA verification.",
        "technicalDetails": "/api/shakti/*/parentalControls for reading Ramsay!'s maturity settings"
      },
      "findings": [
        {
          "label": "Maturity: All Maturity Ratings",
          "detail": "Ramsay! maturity level set to All Maturity Ratings",
          "severity": "informational"
        },
        {
          "label": "MFA gate for changes",
          "detail": "Any maturity level modification requires MFA verification",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard parental controls layout for Ramsay!."
      },
      "securityNotes": [
        "MFA required for any parental control modifications"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls",
        "/api/shakti/*/maturityRestrictions"
      ],
      "comparisonNotes": "Standard profile allows full maturity range.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Ramsay-parental-controls-bottom.png": {
      "filename": "deep-Ramsay-parental-controls-bottom.png",
      "description": "Parental controls section (bottom) for Ramsay! profile showing maturity rating configuration and related settings. Adult profile with configurable maturity level.",
      "phosraRelevance": "Parental controls configuration for Ramsay!. Shows maturity tier (All Maturity Ratings) and navigation to viewing restrictions. Behind MFA for write operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + MFA for writes, Shakti API for reads",
        "notes": "Maturity level for Ramsay! is All Maturity Ratings. Changes require MFA verification.",
        "technicalDetails": "/api/shakti/*/parentalControls for reading Ramsay!'s maturity settings"
      },
      "findings": [
        {
          "label": "Maturity: All Maturity Ratings",
          "detail": "Ramsay! maturity level set to All Maturity Ratings",
          "severity": "informational"
        },
        {
          "label": "MFA gate for changes",
          "detail": "Any maturity level modification requires MFA verification",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard parental controls layout for Ramsay!."
      },
      "securityNotes": [
        "MFA required for any parental control modifications"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls",
        "/api/shakti/*/maturityRestrictions"
      ],
      "comparisonNotes": "Standard profile allows full maturity range.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Ramsay-parental-expanded.png": {
      "filename": "deep-Ramsay-parental-expanded.png",
      "description": "Expanded parental controls view for Ramsay! showing the MFA verification page with three options: Email a code, Text a code, Confirm password. This is the MFA gate that appears before allowing parental control changes.",
      "phosraRelevance": "MFA verification gate for Ramsay!'s parental controls. Three verification methods available. Password confirmation is the most automatable path for Phosra.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + password confirmation (preferred MFA path)",
        "notes": "MFA page appears when navigating to parental control editing. Password confirmation avoids email/SMS code retrieval complexity.",
        "technicalDetails": "await page.click('text=Confirm password'); await page.fill('input[type=\"password\"]', password); await page.click('button:has-text(\"Submit\")');"
      },
      "findings": [
        {
          "label": "3 MFA methods",
          "detail": "Email code, SMS text, and password confirmation available",
          "severity": "critical"
        },
        {
          "label": "Password path preferred",
          "detail": "Password confirmation is simplest for automation — avoids email/SMS code retrieval",
          "severity": "critical"
        },
        {
          "label": "Session-based verification",
          "detail": "Once MFA is completed, changes can be made for that session",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear MFA options page with three distinct verification cards."
      },
      "securityNotes": [
        "MFA prevents children from modifying their own restrictions",
        "Email and phone visible in MFA options"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's MFA gate is stronger than Peacock's approach. Peacock does not require MFA for parental control changes.",
      "gapsIdentified": [
        "MFA adds significant complexity to all write automation"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Ramsay-playback.png": {
      "filename": "deep-Ramsay-playback.png",
      "description": "Playback Settings page for Ramsay! showing Autoplay next episode toggle (on), Autoplay previews toggle (on), and Data usage per screen options (Auto/Low/Medium/High radio buttons).",
      "phosraRelevance": "Autoplay configuration for Ramsay!. Disabling autoplay next episode is a Phosra strategy for reducing passive binge-watching on standard profiles.",
      "relatedRuleCategories": [
        "autoplay_control"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright toggle interaction",
        "notes": "Autoplay toggles changeable without MFA. Per-profile, cross-device setting.",
        "technicalDetails": "await page.click('[data-testid=\"autoplay-next-episode-toggle\"]');"
      },
      "findings": [
        {
          "label": "Autoplay enabled",
          "detail": "Both autoplay toggles are ON for Ramsay! — default Netflix behavior",
          "severity": "important"
        },
        {
          "label": "No MFA required",
          "detail": "Playback settings modifiable without MFA verification",
          "severity": "important"
        },
        {
          "label": "Cross-device",
          "detail": "Settings apply to all devices for this profile",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Simple toggle and radio button interface."
      },
      "securityNotes": [],
      "apiIndicators": [],
      "comparisonNotes": "Autoplay controls identical across Netflix profiles. Peacock has less granular autoplay settings.",
      "gapsIdentified": [
        "No screen time or viewing limit settings in playback preferences"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Ramsay-privacy.png": {
      "filename": "deep-Ramsay-privacy.png",
      "description": "Privacy and data settings page (top) for Ramsay! showing Viewing Privacy (Profile Lock, Viewing activity) and Data Privacy (Matched Identifier Communications toggle, Opt Out of All button).",
      "phosraRelevance": "Privacy configuration for Ramsay!. Profile Lock and Viewing Activity accessible here. Data privacy settings relevant for COPPA compliance on standard profiles.",
      "relatedRuleCategories": [
        "profile_lock",
        "viewing_history_access"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation and toggle interaction",
        "notes": "Privacy page provides alternative path to Profile Lock and Viewing Activity. Data privacy toggle for marketing opt-out.",
        "technicalDetails": "await page.click('text=Profile Lock'); // or await page.click('text=Viewing activity');"
      },
      "findings": [
        {
          "label": "Profile Lock access",
          "detail": "Alternative navigation path to Profile Lock settings",
          "severity": "informational"
        },
        {
          "label": "Viewing activity access",
          "detail": "Alternative path to viewing history management",
          "severity": "informational"
        },
        {
          "label": "Marketing opt-out",
          "detail": "Matched Identifier Communications toggle and Opt Out of All button available",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear privacy settings with distinct Viewing Privacy and Data Privacy sections."
      },
      "securityNotes": [
        "Data privacy opt-out especially relevant for child profiles (COPPA)"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's privacy controls more transparent than Peacock's.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Ramsay-privacy-bottom.png": {
      "filename": "deep-Ramsay-privacy-bottom.png",
      "description": "Privacy and data settings page (bottom) for Ramsay! showing Viewing Privacy (Profile Lock, Viewing activity) and Data Privacy (Matched Identifier Communications toggle, Opt Out of All button).",
      "phosraRelevance": "Privacy configuration for Ramsay!. Profile Lock and Viewing Activity accessible here. Data privacy settings relevant for COPPA compliance on standard profiles.",
      "relatedRuleCategories": [
        "profile_lock",
        "viewing_history_access"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation and toggle interaction",
        "notes": "Privacy page provides alternative path to Profile Lock and Viewing Activity. Data privacy toggle for marketing opt-out.",
        "technicalDetails": "await page.click('text=Profile Lock'); // or await page.click('text=Viewing activity');"
      },
      "findings": [
        {
          "label": "Profile Lock access",
          "detail": "Alternative navigation path to Profile Lock settings",
          "severity": "informational"
        },
        {
          "label": "Viewing activity access",
          "detail": "Alternative path to viewing history management",
          "severity": "informational"
        },
        {
          "label": "Marketing opt-out",
          "detail": "Matched Identifier Communications toggle and Opt Out of All button available",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear privacy settings with distinct Viewing Privacy and Data Privacy sections."
      },
      "securityNotes": [
        "Data privacy opt-out especially relevant for child profiles (COPPA)"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's privacy controls more transparent than Peacock's.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Ramsay-profile-lock.png": {
      "filename": "deep-Ramsay-profile-lock.png",
      "description": "Create a Profile Lock page for Ramsay! showing 4-digit PIN creation interface with 'Create a Profile Lock' button and note about account password requirement.",
      "phosraRelevance": "PIN creation interface for Ramsay!. Critical for Phosra's screen time enforcement strategy — preventing unauthorized access to adult profile.",
      "relatedRuleCategories": [
        "profile_lock"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + password re-entry",
        "notes": "PIN creation for Ramsay! requires account password. 4-digit numeric PIN format.",
        "technicalDetails": "await page.click('text=Create a Profile Lock'); await page.fill('input[name=\"pin\"]', '1234'); await page.fill('input[type=\"password\"]', accountPassword);"
      },
      "findings": [
        {
          "label": "4-digit PIN",
          "detail": "Profile Lock uses 4-digit numeric PIN format",
          "severity": "important"
        },
        {
          "label": "Password required",
          "detail": "Account password re-entry needed (simpler than full MFA)",
          "severity": "important"
        },
        {
          "label": "Access control",
          "detail": "Prevents unauthorized access to adult content profile",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Simple PIN creation page with clear instructions."
      },
      "securityNotes": [
        "Password verification required",
        "PIN stored in Phosra vault for lock/unlock operations"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls/pin"
      ],
      "comparisonNotes": "PIN lock mechanism similar to Peacock's. ",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Ramsay-viewing-activity.png": {
      "filename": "deep-Ramsay-viewing-activity.png",
      "description": "Viewing activity page for Ramsay! showing watch history with title names, dates, and episode info. Entries show kids content (Larva Island, Blippi, etc.). Show More, Back to Your Account, Hide all, and Download all options visible.",
      "phosraRelevance": "Watch history for Ramsay!. Data source for getWatchHistory() adapter method. Shows full viewing history. Critical for Phosra's screen time monitoring via polling.",
      "relatedRuleCategories": [
        "viewing_history_access",
        "screen_time_limit"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Shakti API or Playwright scrape",
        "notes": "Viewing activity for Ramsay! readable via API. Title + date per entry, no duration data.",
        "technicalDetails": "/api/shakti/*/viewingactivity with x-netflix-profileguid header for Ramsay!"
      },
      "findings": [
        {
          "label": "Title + date entries",
          "detail": "Each entry shows title name, date watched, and episode/season info",
          "severity": "important"
        },
        {
          "label": "No duration data",
          "detail": "Watch duration per session not available — only title and date",
          "severity": "critical"
        },
        {
          "label": "Pagination",
          "detail": "Show More button for loading additional history entries",
          "severity": "informational"
        },
        {
          "label": "Export available",
          "detail": "Download all option for CSV export of viewing history",
          "severity": "informational"
        },
        {
          "label": "Kids content visible",
          "detail": "Viewing history shows age-appropriate content (Larva Island, Blippi) confirming maturity restrictions are effective",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clean tabular layout with date, title, and action columns."
      },
      "securityNotes": [
        "Viewing history can be hidden by user, affecting monitoring accuracy"
      ],
      "apiIndicators": [
        "/api/shakti/*/viewingactivity"
      ],
      "comparisonNotes": "Netflix viewing history more detailed than Peacock's with CSV export. ",
      "gapsIdentified": [
        "No duration data limits screen time accuracy",
        "~30 min polling delay for monitoring"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-MomAndDad-settings.png": {
      "filename": "deep-MomAndDad-settings.png",
      "description": "Manage profile and preferences page for Mom and dad (standard profile). Shows profile info, Profile Lock, and Preferences section with Languages, Adjust Parental Controls, Subtitle appearance, Playback settings, Notification settings, Viewing activity, Privacy and data settings. Delete Profile button visible.",
      "phosraRelevance": "Per-profile settings hub for Mom and dad. Standard profile with full settings access. Central navigation point for all Phosra per-profile operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "profile_lock",
        "autoplay_control",
        "viewing_history_access"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation to sub-settings",
        "notes": "Settings hub for Mom and dad. Each link navigates to dedicated settings page.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account/profile?guid=MOMANDDAD_GUID');"
      },
      "findings": [
        {
          "label": "Standard profile settings",
          "detail": "Mom and dad settings page with full options",
          "severity": "informational"
        },
        {
          "label": "Parental controls access",
          "detail": "Adjust Parental Controls link present for maturity and title restriction changes",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Full settings page with clear navigation options."
      },
      "securityNotes": [
        "Full settings access available"
      ],
      "apiIndicators": [
        "Settings page readable without MFA"
      ],
      "comparisonNotes": "Standard profile with full settings comparable to Peacock.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-MomAndDad-parental-controls.png": {
      "filename": "deep-MomAndDad-parental-controls.png",
      "description": "Parental controls section (top) for Mom and dad profile showing maturity rating configuration and related settings. Adult profile with configurable maturity level.",
      "phosraRelevance": "Parental controls configuration for Mom and dad. Shows maturity tier (All Maturity Ratings) and navigation to viewing restrictions. Behind MFA for write operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + MFA for writes, Shakti API for reads",
        "notes": "Maturity level for Mom and dad is All Maturity Ratings. Changes require MFA verification.",
        "technicalDetails": "/api/shakti/*/parentalControls for reading Mom and dad's maturity settings"
      },
      "findings": [
        {
          "label": "Maturity: All Maturity Ratings",
          "detail": "Mom and dad maturity level set to All Maturity Ratings",
          "severity": "informational"
        },
        {
          "label": "MFA gate for changes",
          "detail": "Any maturity level modification requires MFA verification",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard parental controls layout for Mom and dad."
      },
      "securityNotes": [
        "MFA required for any parental control modifications"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls",
        "/api/shakti/*/maturityRestrictions"
      ],
      "comparisonNotes": "Standard profile allows full maturity range.",
      "gapsIdentified": [],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-MomAndDad-parental-controls-mid.png": {
      "filename": "deep-MomAndDad-parental-controls-mid.png",
      "description": "Parental controls section (middle) for Mom and dad profile showing maturity rating configuration and related settings. Adult profile with configurable maturity level.",
      "phosraRelevance": "Parental controls configuration for Mom and dad. Shows maturity tier (All Maturity Ratings) and navigation to viewing restrictions. Behind MFA for write operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + MFA for writes, Shakti API for reads",
        "notes": "Maturity level for Mom and dad is All Maturity Ratings. Changes require MFA verification.",
        "technicalDetails": "/api/shakti/*/parentalControls for reading Mom and dad's maturity settings"
      },
      "findings": [
        {
          "label": "Maturity: All Maturity Ratings",
          "detail": "Mom and dad maturity level set to All Maturity Ratings",
          "severity": "informational"
        },
        {
          "label": "MFA gate for changes",
          "detail": "Any maturity level modification requires MFA verification",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard parental controls layout for Mom and dad."
      },
      "securityNotes": [
        "MFA required for any parental control modifications"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls",
        "/api/shakti/*/maturityRestrictions"
      ],
      "comparisonNotes": "Standard profile allows full maturity range.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-MomAndDad-parental-controls-bottom.png": {
      "filename": "deep-MomAndDad-parental-controls-bottom.png",
      "description": "Parental controls section (bottom) for Mom and dad profile showing maturity rating configuration and related settings. Adult profile with configurable maturity level.",
      "phosraRelevance": "Parental controls configuration for Mom and dad. Shows maturity tier (All Maturity Ratings) and navigation to viewing restrictions. Behind MFA for write operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + MFA for writes, Shakti API for reads",
        "notes": "Maturity level for Mom and dad is All Maturity Ratings. Changes require MFA verification.",
        "technicalDetails": "/api/shakti/*/parentalControls for reading Mom and dad's maturity settings"
      },
      "findings": [
        {
          "label": "Maturity: All Maturity Ratings",
          "detail": "Mom and dad maturity level set to All Maturity Ratings",
          "severity": "informational"
        },
        {
          "label": "MFA gate for changes",
          "detail": "Any maturity level modification requires MFA verification",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard parental controls layout for Mom and dad."
      },
      "securityNotes": [
        "MFA required for any parental control modifications"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls",
        "/api/shakti/*/maturityRestrictions"
      ],
      "comparisonNotes": "Standard profile allows full maturity range.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-MomAndDad-parental-expanded.png": {
      "filename": "deep-MomAndDad-parental-expanded.png",
      "description": "Expanded parental controls view for Mom and dad showing the MFA verification page with three options: Email a code, Text a code, Confirm password. This is the MFA gate that appears before allowing parental control changes.",
      "phosraRelevance": "MFA verification gate for Mom and dad's parental controls. Three verification methods available. Password confirmation is the most automatable path for Phosra.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + password confirmation (preferred MFA path)",
        "notes": "MFA page appears when navigating to parental control editing. Password confirmation avoids email/SMS code retrieval complexity.",
        "technicalDetails": "await page.click('text=Confirm password'); await page.fill('input[type=\"password\"]', password); await page.click('button:has-text(\"Submit\")');"
      },
      "findings": [
        {
          "label": "3 MFA methods",
          "detail": "Email code, SMS text, and password confirmation available",
          "severity": "critical"
        },
        {
          "label": "Password path preferred",
          "detail": "Password confirmation is simplest for automation — avoids email/SMS code retrieval",
          "severity": "critical"
        },
        {
          "label": "Session-based verification",
          "detail": "Once MFA is completed, changes can be made for that session",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear MFA options page with three distinct verification cards."
      },
      "securityNotes": [
        "MFA prevents children from modifying their own restrictions",
        "Email and phone visible in MFA options"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's MFA gate is stronger than Peacock's approach. Peacock does not require MFA for parental control changes.",
      "gapsIdentified": [
        "MFA adds significant complexity to all write automation"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-MomAndDad-playback.png": {
      "filename": "deep-MomAndDad-playback.png",
      "description": "Playback Settings page for Mom and dad showing Autoplay next episode toggle (on), Autoplay previews toggle (on), and Data usage per screen options (Auto/Low/Medium/High radio buttons).",
      "phosraRelevance": "Autoplay configuration for Mom and dad. Disabling autoplay next episode is a Phosra strategy for reducing passive binge-watching on standard profiles.",
      "relatedRuleCategories": [
        "autoplay_control"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright toggle interaction",
        "notes": "Autoplay toggles changeable without MFA. Per-profile, cross-device setting.",
        "technicalDetails": "await page.click('[data-testid=\"autoplay-next-episode-toggle\"]');"
      },
      "findings": [
        {
          "label": "Autoplay enabled",
          "detail": "Both autoplay toggles are ON for Mom and dad — default Netflix behavior",
          "severity": "important"
        },
        {
          "label": "No MFA required",
          "detail": "Playback settings modifiable without MFA verification",
          "severity": "important"
        },
        {
          "label": "Cross-device",
          "detail": "Settings apply to all devices for this profile",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Simple toggle and radio button interface."
      },
      "securityNotes": [],
      "apiIndicators": [],
      "comparisonNotes": "Autoplay controls identical across Netflix profiles. Peacock has less granular autoplay settings.",
      "gapsIdentified": [
        "No screen time or viewing limit settings in playback preferences"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-MomAndDad-privacy.png": {
      "filename": "deep-MomAndDad-privacy.png",
      "description": "Privacy and data settings page (top) for Mom and dad showing Viewing Privacy (Profile Lock, Viewing activity) and Data Privacy (Matched Identifier Communications toggle, Opt Out of All button).",
      "phosraRelevance": "Privacy configuration for Mom and dad. Profile Lock and Viewing Activity accessible here. Data privacy settings relevant for COPPA compliance on standard profiles.",
      "relatedRuleCategories": [
        "profile_lock",
        "viewing_history_access"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation and toggle interaction",
        "notes": "Privacy page provides alternative path to Profile Lock and Viewing Activity. Data privacy toggle for marketing opt-out.",
        "technicalDetails": "await page.click('text=Profile Lock'); // or await page.click('text=Viewing activity');"
      },
      "findings": [
        {
          "label": "Profile Lock access",
          "detail": "Alternative navigation path to Profile Lock settings",
          "severity": "informational"
        },
        {
          "label": "Viewing activity access",
          "detail": "Alternative path to viewing history management",
          "severity": "informational"
        },
        {
          "label": "Marketing opt-out",
          "detail": "Matched Identifier Communications toggle and Opt Out of All button available",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear privacy settings with distinct Viewing Privacy and Data Privacy sections."
      },
      "securityNotes": [
        "Data privacy opt-out especially relevant for child profiles (COPPA)"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's privacy controls more transparent than Peacock's.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-MomAndDad-privacy-bottom.png": {
      "filename": "deep-MomAndDad-privacy-bottom.png",
      "description": "Privacy and data settings page (bottom) for Mom and dad showing Viewing Privacy (Profile Lock, Viewing activity) and Data Privacy (Matched Identifier Communications toggle, Opt Out of All button).",
      "phosraRelevance": "Privacy configuration for Mom and dad. Profile Lock and Viewing Activity accessible here. Data privacy settings relevant for COPPA compliance on standard profiles.",
      "relatedRuleCategories": [
        "profile_lock",
        "viewing_history_access"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation and toggle interaction",
        "notes": "Privacy page provides alternative path to Profile Lock and Viewing Activity. Data privacy toggle for marketing opt-out.",
        "technicalDetails": "await page.click('text=Profile Lock'); // or await page.click('text=Viewing activity');"
      },
      "findings": [
        {
          "label": "Profile Lock access",
          "detail": "Alternative navigation path to Profile Lock settings",
          "severity": "informational"
        },
        {
          "label": "Viewing activity access",
          "detail": "Alternative path to viewing history management",
          "severity": "informational"
        },
        {
          "label": "Marketing opt-out",
          "detail": "Matched Identifier Communications toggle and Opt Out of All button available",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear privacy settings with distinct Viewing Privacy and Data Privacy sections."
      },
      "securityNotes": [
        "Data privacy opt-out especially relevant for child profiles (COPPA)"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's privacy controls more transparent than Peacock's.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-MomAndDad-profile-lock.png": {
      "filename": "deep-MomAndDad-profile-lock.png",
      "description": "Create a Profile Lock page for Mom and dad showing 4-digit PIN creation interface with 'Create a Profile Lock' button and note about account password requirement.",
      "phosraRelevance": "PIN creation interface for Mom and dad. Critical for Phosra's screen time enforcement strategy — preventing unauthorized access to adult profile.",
      "relatedRuleCategories": [
        "profile_lock"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + password re-entry",
        "notes": "PIN creation for Mom and dad requires account password. 4-digit numeric PIN format.",
        "technicalDetails": "await page.click('text=Create a Profile Lock'); await page.fill('input[name=\"pin\"]', '1234'); await page.fill('input[type=\"password\"]', accountPassword);"
      },
      "findings": [
        {
          "label": "4-digit PIN",
          "detail": "Profile Lock uses 4-digit numeric PIN format",
          "severity": "important"
        },
        {
          "label": "Password required",
          "detail": "Account password re-entry needed (simpler than full MFA)",
          "severity": "important"
        },
        {
          "label": "Access control",
          "detail": "Prevents unauthorized access to adult content profile",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Simple PIN creation page with clear instructions."
      },
      "securityNotes": [
        "Password verification required",
        "PIN stored in Phosra vault for lock/unlock operations"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls/pin"
      ],
      "comparisonNotes": "PIN lock mechanism similar to Peacock's. ",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-MomAndDad-viewing-activity.png": {
      "filename": "deep-MomAndDad-viewing-activity.png",
      "description": "Viewing activity page for Mom and dad showing watch history with title names, dates, and episode info. Entries show viewing history entries. Show More, Back to Your Account, Hide all, and Download all options visible.",
      "phosraRelevance": "Watch history for Mom and dad. Data source for getWatchHistory() adapter method. Shows full viewing history. Critical for Phosra's screen time monitoring via polling.",
      "relatedRuleCategories": [
        "viewing_history_access",
        "screen_time_limit"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Shakti API or Playwright scrape",
        "notes": "Viewing activity for Mom and dad readable via API. Title + date per entry, no duration data.",
        "technicalDetails": "/api/shakti/*/viewingactivity with x-netflix-profileguid header for Mom and dad"
      },
      "findings": [
        {
          "label": "Title + date entries",
          "detail": "Each entry shows title name, date watched, and episode/season info",
          "severity": "important"
        },
        {
          "label": "No duration data",
          "detail": "Watch duration per session not available — only title and date",
          "severity": "critical"
        },
        {
          "label": "Pagination",
          "detail": "Show More button for loading additional history entries",
          "severity": "informational"
        },
        {
          "label": "Export available",
          "detail": "Download all option for CSV export of viewing history",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clean tabular layout with date, title, and action columns."
      },
      "securityNotes": [
        "Viewing history can be hidden by user, affecting monitoring accuracy"
      ],
      "apiIndicators": [
        "/api/shakti/*/viewingactivity"
      ],
      "comparisonNotes": "Netflix viewing history more detailed than Peacock's with CSV export. ",
      "gapsIdentified": [
        "No duration data limits screen time accuracy",
        "~30 min polling delay for monitoring"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Samson-settings.png": {
      "filename": "deep-Samson-settings.png",
      "description": "Manage profile and preferences page for Samson (kids profile). Shows profile info, Profile Lock, and Preferences section with Languages, Adjust Parental Controls, Subtitle appearance, Playback settings, Viewing activity. Delete Profile button visible.",
      "phosraRelevance": "Per-profile settings hub for Samson. Kids profile has fewer settings options (no Notifications, no Privacy). Central navigation point for all Phosra per-profile operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "profile_lock",
        "autoplay_control",
        "viewing_history_access",
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation to sub-settings",
        "notes": "Settings hub for Samson. Each link navigates to dedicated settings page.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account/profile?guid=SAMSON_GUID');"
      },
      "findings": [
        {
          "label": "Kids profile settings",
          "detail": "Samson settings page with reduced options",
          "severity": "informational"
        },
        {
          "label": "Parental controls access",
          "detail": "Adjust Parental Controls link present for maturity and title restriction changes",
          "severity": "important"
        },
        {
          "label": "Reduced Kids settings",
          "detail": "Notification settings and Privacy and data settings not shown on Kids profile",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Simplified settings page with clear navigation options."
      },
      "securityNotes": [
        "Kids profile intentionally restricts settings access"
      ],
      "apiIndicators": [
        "Settings page readable without MFA"
      ],
      "comparisonNotes": "Kids profile settings more restricted than adult — security positive design.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Samson-parental-controls.png": {
      "filename": "deep-Samson-parental-controls.png",
      "description": "Parental controls section (top) for Samson profile showing maturity rating configuration and related settings. Kids profile locked to age-appropriate content tiers.",
      "phosraRelevance": "Parental controls configuration for Samson. Shows maturity tier (Older Kids (TV-PG PG and below)) and navigation to viewing restrictions. Behind MFA for write operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + MFA for writes, Shakti API for reads",
        "notes": "Maturity level for Samson is Older Kids (TV-PG PG and below). Changes require MFA verification.",
        "technicalDetails": "/api/shakti/*/parentalControls for reading Samson's maturity settings"
      },
      "findings": [
        {
          "label": "Maturity: Older Kids (TV-PG PG and below)",
          "detail": "Samson maturity level set to Older Kids (TV-PG PG and below)",
          "severity": "important"
        },
        {
          "label": "MFA gate for changes",
          "detail": "Any maturity level modification requires MFA verification",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard parental controls layout for Samson."
      },
      "securityNotes": [
        "MFA required for any parental control modifications"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls",
        "/api/shakti/*/maturityRestrictions"
      ],
      "comparisonNotes": "Kids profile correctly restricted to age-appropriate content.",
      "gapsIdentified": [],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Samson-parental-controls-mid.png": {
      "filename": "deep-Samson-parental-controls-mid.png",
      "description": "Parental controls section (middle) for Samson profile showing maturity rating configuration and related settings. Kids profile locked to age-appropriate content tiers.",
      "phosraRelevance": "Parental controls configuration for Samson. Shows maturity tier (Older Kids (TV-PG PG and below)) and navigation to viewing restrictions. Behind MFA for write operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + MFA for writes, Shakti API for reads",
        "notes": "Maturity level for Samson is Older Kids (TV-PG PG and below). Changes require MFA verification.",
        "technicalDetails": "/api/shakti/*/parentalControls for reading Samson's maturity settings"
      },
      "findings": [
        {
          "label": "Maturity: Older Kids (TV-PG PG and below)",
          "detail": "Samson maturity level set to Older Kids (TV-PG PG and below)",
          "severity": "important"
        },
        {
          "label": "MFA gate for changes",
          "detail": "Any maturity level modification requires MFA verification",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard parental controls layout for Samson."
      },
      "securityNotes": [
        "MFA required for any parental control modifications"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls",
        "/api/shakti/*/maturityRestrictions"
      ],
      "comparisonNotes": "Kids profile correctly restricted to age-appropriate content.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Samson-parental-controls-bottom.png": {
      "filename": "deep-Samson-parental-controls-bottom.png",
      "description": "Parental controls section (bottom) for Samson profile showing maturity rating configuration and related settings. Kids profile locked to age-appropriate content tiers.",
      "phosraRelevance": "Parental controls configuration for Samson. Shows maturity tier (Older Kids (TV-PG PG and below)) and navigation to viewing restrictions. Behind MFA for write operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + MFA for writes, Shakti API for reads",
        "notes": "Maturity level for Samson is Older Kids (TV-PG PG and below). Changes require MFA verification.",
        "technicalDetails": "/api/shakti/*/parentalControls for reading Samson's maturity settings"
      },
      "findings": [
        {
          "label": "Maturity: Older Kids (TV-PG PG and below)",
          "detail": "Samson maturity level set to Older Kids (TV-PG PG and below)",
          "severity": "important"
        },
        {
          "label": "MFA gate for changes",
          "detail": "Any maturity level modification requires MFA verification",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard parental controls layout for Samson."
      },
      "securityNotes": [
        "MFA required for any parental control modifications"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls",
        "/api/shakti/*/maturityRestrictions"
      ],
      "comparisonNotes": "Kids profile correctly restricted to age-appropriate content.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Samson-parental-expanded.png": {
      "filename": "deep-Samson-parental-expanded.png",
      "description": "Expanded parental controls view for Samson showing the MFA verification page with three options: Email a code, Text a code, Confirm password. This is the MFA gate that appears before allowing parental control changes.",
      "phosraRelevance": "MFA verification gate for Samson's parental controls. Three verification methods available. Password confirmation is the most automatable path for Phosra.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + password confirmation (preferred MFA path)",
        "notes": "MFA page appears when navigating to parental control editing. Password confirmation avoids email/SMS code retrieval complexity.",
        "technicalDetails": "await page.click('text=Confirm password'); await page.fill('input[type=\"password\"]', password); await page.click('button:has-text(\"Submit\")');"
      },
      "findings": [
        {
          "label": "3 MFA methods",
          "detail": "Email code, SMS text, and password confirmation available",
          "severity": "critical"
        },
        {
          "label": "Password path preferred",
          "detail": "Password confirmation is simplest for automation — avoids email/SMS code retrieval",
          "severity": "critical"
        },
        {
          "label": "Session-based verification",
          "detail": "Once MFA is completed, changes can be made for that session",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear MFA options page with three distinct verification cards."
      },
      "securityNotes": [
        "MFA prevents children from modifying their own restrictions",
        "Email and phone visible in MFA options"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's MFA gate is stronger than Peacock's approach. Peacock does not require MFA for parental control changes.",
      "gapsIdentified": [
        "MFA adds significant complexity to all write automation"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Samson-playback.png": {
      "filename": "deep-Samson-playback.png",
      "description": "Playback Settings page for Samson showing Autoplay next episode toggle (on), Autoplay previews toggle (on), and Data usage per screen options (Auto/Low/Medium/High radio buttons).",
      "phosraRelevance": "Autoplay configuration for Samson. Disabling autoplay next episode is a Phosra strategy for reducing passive binge-watching on kids profiles.",
      "relatedRuleCategories": [
        "autoplay_control"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright toggle interaction",
        "notes": "Autoplay toggles changeable without MFA. Per-profile, cross-device setting.",
        "technicalDetails": "await page.click('[data-testid=\"autoplay-next-episode-toggle\"]');"
      },
      "findings": [
        {
          "label": "Autoplay enabled",
          "detail": "Both autoplay toggles are ON for Samson — default Netflix behavior",
          "severity": "important"
        },
        {
          "label": "No MFA required",
          "detail": "Playback settings modifiable without MFA verification",
          "severity": "important"
        },
        {
          "label": "Cross-device",
          "detail": "Settings apply to all devices for this profile",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Simple toggle and radio button interface."
      },
      "securityNotes": [],
      "apiIndicators": [],
      "comparisonNotes": "Autoplay controls identical across Netflix profiles. Peacock has less granular autoplay settings.",
      "gapsIdentified": [
        "No screen time or viewing limit settings in playback preferences"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Samson-privacy.png": {
      "filename": "deep-Samson-privacy.png",
      "description": "Privacy and data settings page (top) for Samson showing Viewing Privacy (Profile Lock, Viewing activity) and Data Privacy (Matched Identifier Communications toggle, Opt Out of All button).",
      "phosraRelevance": "Privacy configuration for Samson. Profile Lock and Viewing Activity accessible here. Data privacy settings relevant for COPPA compliance on Kids profiles.",
      "relatedRuleCategories": [
        "profile_lock",
        "viewing_history_access",
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation and toggle interaction",
        "notes": "Privacy page provides alternative path to Profile Lock and Viewing Activity. Data privacy toggle for marketing opt-out.",
        "technicalDetails": "await page.click('text=Profile Lock'); // or await page.click('text=Viewing activity');"
      },
      "findings": [
        {
          "label": "Profile Lock access",
          "detail": "Alternative navigation path to Profile Lock settings",
          "severity": "informational"
        },
        {
          "label": "Viewing activity access",
          "detail": "Alternative path to viewing history management",
          "severity": "informational"
        },
        {
          "label": "Marketing opt-out",
          "detail": "Matched Identifier Communications toggle and Opt Out of All button available",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear privacy settings with distinct Viewing Privacy and Data Privacy sections."
      },
      "securityNotes": [
        "Data privacy opt-out especially relevant for child profiles (COPPA)"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's privacy controls more transparent than Peacock's.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Samson-privacy-bottom.png": {
      "filename": "deep-Samson-privacy-bottom.png",
      "description": "Privacy and data settings page (bottom) for Samson showing Viewing Privacy (Profile Lock, Viewing activity) and Data Privacy (Matched Identifier Communications toggle, Opt Out of All button).",
      "phosraRelevance": "Privacy configuration for Samson. Profile Lock and Viewing Activity accessible here. Data privacy settings relevant for COPPA compliance on Kids profiles.",
      "relatedRuleCategories": [
        "profile_lock",
        "viewing_history_access",
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation and toggle interaction",
        "notes": "Privacy page provides alternative path to Profile Lock and Viewing Activity. Data privacy toggle for marketing opt-out.",
        "technicalDetails": "await page.click('text=Profile Lock'); // or await page.click('text=Viewing activity');"
      },
      "findings": [
        {
          "label": "Profile Lock access",
          "detail": "Alternative navigation path to Profile Lock settings",
          "severity": "informational"
        },
        {
          "label": "Viewing activity access",
          "detail": "Alternative path to viewing history management",
          "severity": "informational"
        },
        {
          "label": "Marketing opt-out",
          "detail": "Matched Identifier Communications toggle and Opt Out of All button available",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear privacy settings with distinct Viewing Privacy and Data Privacy sections."
      },
      "securityNotes": [
        "Data privacy opt-out especially relevant for child profiles (COPPA)"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's privacy controls more transparent than Peacock's.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Samson-profile-lock.png": {
      "filename": "deep-Samson-profile-lock.png",
      "description": "Create a Profile Lock page for Samson showing 4-digit PIN creation interface with 'Create a Profile Lock' button and note about account password requirement.",
      "phosraRelevance": "PIN creation interface for Samson. Critical for Phosra's screen time enforcement strategy — locking kids profile when daily limit reached.",
      "relatedRuleCategories": [
        "profile_lock",
        "screen_time_limit"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + password re-entry",
        "notes": "PIN creation for Samson requires account password. 4-digit numeric PIN format.",
        "technicalDetails": "await page.click('text=Create a Profile Lock'); await page.fill('input[name=\"pin\"]', '1234'); await page.fill('input[type=\"password\"]', accountPassword);"
      },
      "findings": [
        {
          "label": "4-digit PIN",
          "detail": "Profile Lock uses 4-digit numeric PIN format",
          "severity": "important"
        },
        {
          "label": "Password required",
          "detail": "Account password re-entry needed (simpler than full MFA)",
          "severity": "important"
        },
        {
          "label": "Screen time enforcement",
          "detail": "Phosra locks this profile by changing PIN when daily limit reached",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Simple PIN creation page with clear instructions."
      },
      "securityNotes": [
        "Password verification required",
        "PIN stored in Phosra vault for lock/unlock operations"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls/pin"
      ],
      "comparisonNotes": "PIN lock mechanism similar to Peacock's. Critical for Phosra screen time strategy on Netflix.",
      "gapsIdentified": [
        "PIN alone does not enforce time limits — requires Phosra automation layer"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Samson-viewing-activity.png": {
      "filename": "deep-Samson-viewing-activity.png",
      "description": "Viewing activity page for Samson showing watch history with title names, dates, and episode info. Entries show kids content (Larva Island, Blippi, etc.). Show More, Back to Your Account, Hide all, and Download all options visible.",
      "phosraRelevance": "Watch history for Samson. Data source for getWatchHistory() adapter method. Shows kids content confirming maturity restrictions are working. Critical for Phosra's screen time monitoring via polling.",
      "relatedRuleCategories": [
        "viewing_history_access",
        "screen_time_limit"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Shakti API or Playwright scrape",
        "notes": "Viewing activity for Samson readable via API. Title + date per entry, no duration data.",
        "technicalDetails": "/api/shakti/*/viewingactivity with x-netflix-profileguid header for Samson"
      },
      "findings": [
        {
          "label": "Title + date entries",
          "detail": "Each entry shows title name, date watched, and episode/season info",
          "severity": "important"
        },
        {
          "label": "No duration data",
          "detail": "Watch duration per session not available — only title and date",
          "severity": "critical"
        },
        {
          "label": "Pagination",
          "detail": "Show More button for loading additional history entries",
          "severity": "informational"
        },
        {
          "label": "Export available",
          "detail": "Download all option for CSV export of viewing history",
          "severity": "informational"
        },
        {
          "label": "Kids content visible",
          "detail": "Viewing history shows age-appropriate content (Larva Island, Blippi) confirming maturity restrictions are effective",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clean tabular layout with date, title, and action columns."
      },
      "securityNotes": [
        "Viewing history can be hidden by user, affecting monitoring accuracy"
      ],
      "apiIndicators": [
        "/api/shakti/*/viewingactivity"
      ],
      "comparisonNotes": "Netflix viewing history more detailed than Peacock's with CSV export. Kids profile history confirms maturity filtering works.",
      "gapsIdentified": [
        "No duration data limits screen time accuracy",
        "~30 min polling delay for monitoring"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Chap-settings.png": {
      "filename": "deep-Chap-settings.png",
      "description": "Manage profile and preferences page for Chap (kids profile). Shows profile info, Profile Lock, and Preferences section with Languages, Adjust Parental Controls, Subtitle appearance, Playback settings, Viewing activity. Delete Profile button visible.",
      "phosraRelevance": "Per-profile settings hub for Chap. Kids profile has fewer settings options (no Notifications, no Privacy). Central navigation point for all Phosra per-profile operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "profile_lock",
        "autoplay_control",
        "viewing_history_access",
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation to sub-settings",
        "notes": "Settings hub for Chap. Each link navigates to dedicated settings page.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account/profile?guid=CHAP_GUID');"
      },
      "findings": [
        {
          "label": "Kids profile settings",
          "detail": "Chap settings page with reduced options",
          "severity": "informational"
        },
        {
          "label": "Parental controls access",
          "detail": "Adjust Parental Controls link present for maturity and title restriction changes",
          "severity": "important"
        },
        {
          "label": "Reduced Kids settings",
          "detail": "Notification settings and Privacy and data settings not shown on Kids profile",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Simplified settings page with clear navigation options."
      },
      "securityNotes": [
        "Kids profile intentionally restricts settings access"
      ],
      "apiIndicators": [
        "Settings page readable without MFA"
      ],
      "comparisonNotes": "Kids profile settings more restricted than adult — security positive design.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Chap-parental-controls.png": {
      "filename": "deep-Chap-parental-controls.png",
      "description": "Parental controls section (top) for Chap profile showing maturity rating configuration and related settings. Kids profile locked to age-appropriate content tiers.",
      "phosraRelevance": "Parental controls configuration for Chap. Shows maturity tier (Older Kids (TV-PG PG and below)) and navigation to viewing restrictions. Behind MFA for write operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + MFA for writes, Shakti API for reads",
        "notes": "Maturity level for Chap is Older Kids (TV-PG PG and below). Changes require MFA verification.",
        "technicalDetails": "/api/shakti/*/parentalControls for reading Chap's maturity settings"
      },
      "findings": [
        {
          "label": "Maturity: Older Kids (TV-PG PG and below)",
          "detail": "Chap maturity level set to Older Kids (TV-PG PG and below)",
          "severity": "important"
        },
        {
          "label": "MFA gate for changes",
          "detail": "Any maturity level modification requires MFA verification",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard parental controls layout for Chap."
      },
      "securityNotes": [
        "MFA required for any parental control modifications"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls",
        "/api/shakti/*/maturityRestrictions"
      ],
      "comparisonNotes": "Kids profile correctly restricted to age-appropriate content.",
      "gapsIdentified": [],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Chap-parental-controls-mid.png": {
      "filename": "deep-Chap-parental-controls-mid.png",
      "description": "Parental controls section (middle) for Chap profile showing maturity rating configuration and related settings. Kids profile locked to age-appropriate content tiers.",
      "phosraRelevance": "Parental controls configuration for Chap. Shows maturity tier (Older Kids (TV-PG PG and below)) and navigation to viewing restrictions. Behind MFA for write operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + MFA for writes, Shakti API for reads",
        "notes": "Maturity level for Chap is Older Kids (TV-PG PG and below). Changes require MFA verification.",
        "technicalDetails": "/api/shakti/*/parentalControls for reading Chap's maturity settings"
      },
      "findings": [
        {
          "label": "Maturity: Older Kids (TV-PG PG and below)",
          "detail": "Chap maturity level set to Older Kids (TV-PG PG and below)",
          "severity": "important"
        },
        {
          "label": "MFA gate for changes",
          "detail": "Any maturity level modification requires MFA verification",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard parental controls layout for Chap."
      },
      "securityNotes": [
        "MFA required for any parental control modifications"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls",
        "/api/shakti/*/maturityRestrictions"
      ],
      "comparisonNotes": "Kids profile correctly restricted to age-appropriate content.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Chap-parental-controls-bottom.png": {
      "filename": "deep-Chap-parental-controls-bottom.png",
      "description": "Parental controls section (bottom) for Chap profile showing maturity rating configuration and related settings. Kids profile locked to age-appropriate content tiers.",
      "phosraRelevance": "Parental controls configuration for Chap. Shows maturity tier (Older Kids (TV-PG PG and below)) and navigation to viewing restrictions. Behind MFA for write operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + MFA for writes, Shakti API for reads",
        "notes": "Maturity level for Chap is Older Kids (TV-PG PG and below). Changes require MFA verification.",
        "technicalDetails": "/api/shakti/*/parentalControls for reading Chap's maturity settings"
      },
      "findings": [
        {
          "label": "Maturity: Older Kids (TV-PG PG and below)",
          "detail": "Chap maturity level set to Older Kids (TV-PG PG and below)",
          "severity": "important"
        },
        {
          "label": "MFA gate for changes",
          "detail": "Any maturity level modification requires MFA verification",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard parental controls layout for Chap."
      },
      "securityNotes": [
        "MFA required for any parental control modifications"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls",
        "/api/shakti/*/maturityRestrictions"
      ],
      "comparisonNotes": "Kids profile correctly restricted to age-appropriate content.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Chap-parental-expanded.png": {
      "filename": "deep-Chap-parental-expanded.png",
      "description": "Expanded parental controls view for Chap showing the MFA verification page with three options: Email a code, Text a code, Confirm password. This is the MFA gate that appears before allowing parental control changes.",
      "phosraRelevance": "MFA verification gate for Chap's parental controls. Three verification methods available. Password confirmation is the most automatable path for Phosra.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + password confirmation (preferred MFA path)",
        "notes": "MFA page appears when navigating to parental control editing. Password confirmation avoids email/SMS code retrieval complexity.",
        "technicalDetails": "await page.click('text=Confirm password'); await page.fill('input[type=\"password\"]', password); await page.click('button:has-text(\"Submit\")');"
      },
      "findings": [
        {
          "label": "3 MFA methods",
          "detail": "Email code, SMS text, and password confirmation available",
          "severity": "critical"
        },
        {
          "label": "Password path preferred",
          "detail": "Password confirmation is simplest for automation — avoids email/SMS code retrieval",
          "severity": "critical"
        },
        {
          "label": "Session-based verification",
          "detail": "Once MFA is completed, changes can be made for that session",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear MFA options page with three distinct verification cards."
      },
      "securityNotes": [
        "MFA prevents children from modifying their own restrictions",
        "Email and phone visible in MFA options"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's MFA gate is stronger than Peacock's approach. Peacock does not require MFA for parental control changes.",
      "gapsIdentified": [
        "MFA adds significant complexity to all write automation"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Chap-playback.png": {
      "filename": "deep-Chap-playback.png",
      "description": "Playback Settings page for Chap showing Autoplay next episode toggle (on), Autoplay previews toggle (on), and Data usage per screen options (Auto/Low/Medium/High radio buttons).",
      "phosraRelevance": "Autoplay configuration for Chap. Disabling autoplay next episode is a Phosra strategy for reducing passive binge-watching on kids profiles.",
      "relatedRuleCategories": [
        "autoplay_control"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright toggle interaction",
        "notes": "Autoplay toggles changeable without MFA. Per-profile, cross-device setting.",
        "technicalDetails": "await page.click('[data-testid=\"autoplay-next-episode-toggle\"]');"
      },
      "findings": [
        {
          "label": "Autoplay enabled",
          "detail": "Both autoplay toggles are ON for Chap — default Netflix behavior",
          "severity": "important"
        },
        {
          "label": "No MFA required",
          "detail": "Playback settings modifiable without MFA verification",
          "severity": "important"
        },
        {
          "label": "Cross-device",
          "detail": "Settings apply to all devices for this profile",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Simple toggle and radio button interface."
      },
      "securityNotes": [],
      "apiIndicators": [],
      "comparisonNotes": "Autoplay controls identical across Netflix profiles. Peacock has less granular autoplay settings.",
      "gapsIdentified": [
        "No screen time or viewing limit settings in playback preferences"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Chap-privacy.png": {
      "filename": "deep-Chap-privacy.png",
      "description": "Privacy and data settings page (top) for Chap showing Viewing Privacy (Profile Lock, Viewing activity) and Data Privacy (Matched Identifier Communications toggle, Opt Out of All button).",
      "phosraRelevance": "Privacy configuration for Chap. Profile Lock and Viewing Activity accessible here. Data privacy settings relevant for COPPA compliance on Kids profiles.",
      "relatedRuleCategories": [
        "profile_lock",
        "viewing_history_access",
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation and toggle interaction",
        "notes": "Privacy page provides alternative path to Profile Lock and Viewing Activity. Data privacy toggle for marketing opt-out.",
        "technicalDetails": "await page.click('text=Profile Lock'); // or await page.click('text=Viewing activity');"
      },
      "findings": [
        {
          "label": "Profile Lock access",
          "detail": "Alternative navigation path to Profile Lock settings",
          "severity": "informational"
        },
        {
          "label": "Viewing activity access",
          "detail": "Alternative path to viewing history management",
          "severity": "informational"
        },
        {
          "label": "Marketing opt-out",
          "detail": "Matched Identifier Communications toggle and Opt Out of All button available",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear privacy settings with distinct Viewing Privacy and Data Privacy sections."
      },
      "securityNotes": [
        "Data privacy opt-out especially relevant for child profiles (COPPA)"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's privacy controls more transparent than Peacock's.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Chap-privacy-bottom.png": {
      "filename": "deep-Chap-privacy-bottom.png",
      "description": "Privacy and data settings page (bottom) for Chap showing Viewing Privacy (Profile Lock, Viewing activity) and Data Privacy (Matched Identifier Communications toggle, Opt Out of All button).",
      "phosraRelevance": "Privacy configuration for Chap. Profile Lock and Viewing Activity accessible here. Data privacy settings relevant for COPPA compliance on Kids profiles.",
      "relatedRuleCategories": [
        "profile_lock",
        "viewing_history_access",
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation and toggle interaction",
        "notes": "Privacy page provides alternative path to Profile Lock and Viewing Activity. Data privacy toggle for marketing opt-out.",
        "technicalDetails": "await page.click('text=Profile Lock'); // or await page.click('text=Viewing activity');"
      },
      "findings": [
        {
          "label": "Profile Lock access",
          "detail": "Alternative navigation path to Profile Lock settings",
          "severity": "informational"
        },
        {
          "label": "Viewing activity access",
          "detail": "Alternative path to viewing history management",
          "severity": "informational"
        },
        {
          "label": "Marketing opt-out",
          "detail": "Matched Identifier Communications toggle and Opt Out of All button available",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear privacy settings with distinct Viewing Privacy and Data Privacy sections."
      },
      "securityNotes": [
        "Data privacy opt-out especially relevant for child profiles (COPPA)"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's privacy controls more transparent than Peacock's.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Chap-profile-lock.png": {
      "filename": "deep-Chap-profile-lock.png",
      "description": "Create a Profile Lock page for Chap showing 4-digit PIN creation interface with 'Create a Profile Lock' button and note about account password requirement.",
      "phosraRelevance": "PIN creation interface for Chap. Critical for Phosra's screen time enforcement strategy — locking kids profile when daily limit reached.",
      "relatedRuleCategories": [
        "profile_lock",
        "screen_time_limit"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + password re-entry",
        "notes": "PIN creation for Chap requires account password. 4-digit numeric PIN format.",
        "technicalDetails": "await page.click('text=Create a Profile Lock'); await page.fill('input[name=\"pin\"]', '1234'); await page.fill('input[type=\"password\"]', accountPassword);"
      },
      "findings": [
        {
          "label": "4-digit PIN",
          "detail": "Profile Lock uses 4-digit numeric PIN format",
          "severity": "important"
        },
        {
          "label": "Password required",
          "detail": "Account password re-entry needed (simpler than full MFA)",
          "severity": "important"
        },
        {
          "label": "Screen time enforcement",
          "detail": "Phosra locks this profile by changing PIN when daily limit reached",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Simple PIN creation page with clear instructions."
      },
      "securityNotes": [
        "Password verification required",
        "PIN stored in Phosra vault for lock/unlock operations"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls/pin"
      ],
      "comparisonNotes": "PIN lock mechanism similar to Peacock's. Critical for Phosra screen time strategy on Netflix.",
      "gapsIdentified": [
        "PIN alone does not enforce time limits — requires Phosra automation layer"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Chap-viewing-activity.png": {
      "filename": "deep-Chap-viewing-activity.png",
      "description": "Viewing activity page for Chap showing watch history with title names, dates, and episode info. Entries show kids content (Larva Island, Blippi, etc.). Show More, Back to Your Account, Hide all, and Download all options visible.",
      "phosraRelevance": "Watch history for Chap. Data source for getWatchHistory() adapter method. Shows kids content confirming maturity restrictions are working. Critical for Phosra's screen time monitoring via polling.",
      "relatedRuleCategories": [
        "viewing_history_access",
        "screen_time_limit"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Shakti API or Playwright scrape",
        "notes": "Viewing activity for Chap readable via API. Title + date per entry, no duration data.",
        "technicalDetails": "/api/shakti/*/viewingactivity with x-netflix-profileguid header for Chap"
      },
      "findings": [
        {
          "label": "Title + date entries",
          "detail": "Each entry shows title name, date watched, and episode/season info",
          "severity": "important"
        },
        {
          "label": "No duration data",
          "detail": "Watch duration per session not available — only title and date",
          "severity": "critical"
        },
        {
          "label": "Pagination",
          "detail": "Show More button for loading additional history entries",
          "severity": "informational"
        },
        {
          "label": "Export available",
          "detail": "Download all option for CSV export of viewing history",
          "severity": "informational"
        },
        {
          "label": "Kids content visible",
          "detail": "Viewing history shows age-appropriate content (Larva Island, Blippi) confirming maturity restrictions are effective",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clean tabular layout with date, title, and action columns."
      },
      "securityNotes": [
        "Viewing history can be hidden by user, affecting monitoring accuracy"
      ],
      "apiIndicators": [
        "/api/shakti/*/viewingactivity"
      ],
      "comparisonNotes": "Netflix viewing history more detailed than Peacock's with CSV export. Kids profile history confirms maturity filtering works.",
      "gapsIdentified": [
        "No duration data limits screen time accuracy",
        "~30 min polling delay for monitoring"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Banana-settings.png": {
      "filename": "deep-Banana-settings.png",
      "description": "Manage profile and preferences page for BANANA!!!!!!!! (kids profile). Shows profile info, Profile Lock, and Preferences section with Languages, Adjust Parental Controls, Subtitle appearance, Playback settings, Viewing activity. Delete Profile button visible.",
      "phosraRelevance": "Per-profile settings hub for BANANA!!!!!!!!. Kids profile has fewer settings options (no Notifications, no Privacy). Central navigation point for all Phosra per-profile operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "profile_lock",
        "autoplay_control",
        "viewing_history_access",
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation to sub-settings",
        "notes": "Settings hub for BANANA!!!!!!!!. Each link navigates to dedicated settings page.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account/profile?guid=BANANA_GUID');"
      },
      "findings": [
        {
          "label": "Kids profile settings",
          "detail": "BANANA!!!!!!!! settings page with reduced options",
          "severity": "informational"
        },
        {
          "label": "Parental controls access",
          "detail": "Adjust Parental Controls link present for maturity and title restriction changes",
          "severity": "important"
        },
        {
          "label": "Reduced Kids settings",
          "detail": "Notification settings and Privacy and data settings not shown on Kids profile",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Simplified settings page with clear navigation options."
      },
      "securityNotes": [
        "Kids profile intentionally restricts settings access"
      ],
      "apiIndicators": [
        "Settings page readable without MFA"
      ],
      "comparisonNotes": "Kids profile settings more restricted than adult — security positive design.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Banana-parental-controls.png": {
      "filename": "deep-Banana-parental-controls.png",
      "description": "Parental controls section (top) for BANANA!!!!!!!! profile showing maturity rating configuration and related settings. Kids profile locked to age-appropriate content tiers.",
      "phosraRelevance": "Parental controls configuration for BANANA!!!!!!!!. Shows maturity tier (Older Kids (TV-PG PG and below)) and navigation to viewing restrictions. Behind MFA for write operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + MFA for writes, Shakti API for reads",
        "notes": "Maturity level for BANANA!!!!!!!! is Older Kids (TV-PG PG and below). Changes require MFA verification.",
        "technicalDetails": "/api/shakti/*/parentalControls for reading BANANA!!!!!!!!'s maturity settings"
      },
      "findings": [
        {
          "label": "Maturity: Older Kids (TV-PG PG and below)",
          "detail": "BANANA!!!!!!!! maturity level set to Older Kids (TV-PG PG and below)",
          "severity": "important"
        },
        {
          "label": "MFA gate for changes",
          "detail": "Any maturity level modification requires MFA verification",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard parental controls layout for BANANA!!!!!!!!."
      },
      "securityNotes": [
        "MFA required for any parental control modifications"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls",
        "/api/shakti/*/maturityRestrictions"
      ],
      "comparisonNotes": "Kids profile correctly restricted to age-appropriate content.",
      "gapsIdentified": [],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Banana-parental-controls-mid.png": {
      "filename": "deep-Banana-parental-controls-mid.png",
      "description": "Parental controls section (middle) for BANANA!!!!!!!! profile showing maturity rating configuration and related settings. Kids profile locked to age-appropriate content tiers.",
      "phosraRelevance": "Parental controls configuration for BANANA!!!!!!!!. Shows maturity tier (Older Kids (TV-PG PG and below)) and navigation to viewing restrictions. Behind MFA for write operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + MFA for writes, Shakti API for reads",
        "notes": "Maturity level for BANANA!!!!!!!! is Older Kids (TV-PG PG and below). Changes require MFA verification.",
        "technicalDetails": "/api/shakti/*/parentalControls for reading BANANA!!!!!!!!'s maturity settings"
      },
      "findings": [
        {
          "label": "Maturity: Older Kids (TV-PG PG and below)",
          "detail": "BANANA!!!!!!!! maturity level set to Older Kids (TV-PG PG and below)",
          "severity": "important"
        },
        {
          "label": "MFA gate for changes",
          "detail": "Any maturity level modification requires MFA verification",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard parental controls layout for BANANA!!!!!!!!."
      },
      "securityNotes": [
        "MFA required for any parental control modifications"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls",
        "/api/shakti/*/maturityRestrictions"
      ],
      "comparisonNotes": "Kids profile correctly restricted to age-appropriate content.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Banana-parental-controls-bottom.png": {
      "filename": "deep-Banana-parental-controls-bottom.png",
      "description": "Parental controls section (bottom) for BANANA!!!!!!!! profile showing maturity rating configuration and related settings. Kids profile locked to age-appropriate content tiers.",
      "phosraRelevance": "Parental controls configuration for BANANA!!!!!!!!. Shows maturity tier (Older Kids (TV-PG PG and below)) and navigation to viewing restrictions. Behind MFA for write operations.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + MFA for writes, Shakti API for reads",
        "notes": "Maturity level for BANANA!!!!!!!! is Older Kids (TV-PG PG and below). Changes require MFA verification.",
        "technicalDetails": "/api/shakti/*/parentalControls for reading BANANA!!!!!!!!'s maturity settings"
      },
      "findings": [
        {
          "label": "Maturity: Older Kids (TV-PG PG and below)",
          "detail": "BANANA!!!!!!!! maturity level set to Older Kids (TV-PG PG and below)",
          "severity": "important"
        },
        {
          "label": "MFA gate for changes",
          "detail": "Any maturity level modification requires MFA verification",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard parental controls layout for BANANA!!!!!!!!."
      },
      "securityNotes": [
        "MFA required for any parental control modifications"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls",
        "/api/shakti/*/maturityRestrictions"
      ],
      "comparisonNotes": "Kids profile correctly restricted to age-appropriate content.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Banana-parental-expanded.png": {
      "filename": "deep-Banana-parental-expanded.png",
      "description": "Expanded parental controls view for BANANA!!!!!!!! showing the MFA verification page with three options: Email a code, Text a code, Confirm password. This is the MFA gate that appears before allowing parental control changes.",
      "phosraRelevance": "MFA verification gate for BANANA!!!!!!!!'s parental controls. Three verification methods available. Password confirmation is the most automatable path for Phosra.",
      "relatedRuleCategories": [
        "content_rating_filter",
        "title_restriction",
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + password confirmation (preferred MFA path)",
        "notes": "MFA page appears when navigating to parental control editing. Password confirmation avoids email/SMS code retrieval complexity.",
        "technicalDetails": "await page.click('text=Confirm password'); await page.fill('input[type=\"password\"]', password); await page.click('button:has-text(\"Submit\")');"
      },
      "findings": [
        {
          "label": "3 MFA methods",
          "detail": "Email code, SMS text, and password confirmation available",
          "severity": "critical"
        },
        {
          "label": "Password path preferred",
          "detail": "Password confirmation is simplest for automation — avoids email/SMS code retrieval",
          "severity": "critical"
        },
        {
          "label": "Session-based verification",
          "detail": "Once MFA is completed, changes can be made for that session",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear MFA options page with three distinct verification cards."
      },
      "securityNotes": [
        "MFA prevents children from modifying their own restrictions",
        "Email and phone visible in MFA options"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's MFA gate is stronger than Peacock's approach. Peacock does not require MFA for parental control changes.",
      "gapsIdentified": [
        "MFA adds significant complexity to all write automation"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Banana-playback.png": {
      "filename": "deep-Banana-playback.png",
      "description": "Playback Settings page for BANANA!!!!!!!! showing Autoplay next episode toggle (on), Autoplay previews toggle (on), and Data usage per screen options (Auto/Low/Medium/High radio buttons).",
      "phosraRelevance": "Autoplay configuration for BANANA!!!!!!!!. Disabling autoplay next episode is a Phosra strategy for reducing passive binge-watching on kids profiles.",
      "relatedRuleCategories": [
        "autoplay_control"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright toggle interaction",
        "notes": "Autoplay toggles changeable without MFA. Per-profile, cross-device setting.",
        "technicalDetails": "await page.click('[data-testid=\"autoplay-next-episode-toggle\"]');"
      },
      "findings": [
        {
          "label": "Autoplay enabled",
          "detail": "Both autoplay toggles are ON for BANANA!!!!!!!! — default Netflix behavior",
          "severity": "important"
        },
        {
          "label": "No MFA required",
          "detail": "Playback settings modifiable without MFA verification",
          "severity": "important"
        },
        {
          "label": "Cross-device",
          "detail": "Settings apply to all devices for this profile",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Simple toggle and radio button interface."
      },
      "securityNotes": [],
      "apiIndicators": [],
      "comparisonNotes": "Autoplay controls identical across Netflix profiles. Peacock has less granular autoplay settings.",
      "gapsIdentified": [
        "No screen time or viewing limit settings in playback preferences"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Banana-privacy.png": {
      "filename": "deep-Banana-privacy.png",
      "description": "Privacy and data settings page (top) for BANANA!!!!!!!! showing Viewing Privacy (Profile Lock, Viewing activity) and Data Privacy (Matched Identifier Communications toggle, Opt Out of All button).",
      "phosraRelevance": "Privacy configuration for BANANA!!!!!!!!. Profile Lock and Viewing Activity accessible here. Data privacy settings relevant for COPPA compliance on Kids profiles.",
      "relatedRuleCategories": [
        "profile_lock",
        "viewing_history_access",
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation and toggle interaction",
        "notes": "Privacy page provides alternative path to Profile Lock and Viewing Activity. Data privacy toggle for marketing opt-out.",
        "technicalDetails": "await page.click('text=Profile Lock'); // or await page.click('text=Viewing activity');"
      },
      "findings": [
        {
          "label": "Profile Lock access",
          "detail": "Alternative navigation path to Profile Lock settings",
          "severity": "informational"
        },
        {
          "label": "Viewing activity access",
          "detail": "Alternative path to viewing history management",
          "severity": "informational"
        },
        {
          "label": "Marketing opt-out",
          "detail": "Matched Identifier Communications toggle and Opt Out of All button available",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear privacy settings with distinct Viewing Privacy and Data Privacy sections."
      },
      "securityNotes": [
        "Data privacy opt-out especially relevant for child profiles (COPPA)"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's privacy controls more transparent than Peacock's.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Banana-privacy-bottom.png": {
      "filename": "deep-Banana-privacy-bottom.png",
      "description": "Privacy and data settings page (bottom) for BANANA!!!!!!!! showing Viewing Privacy (Profile Lock, Viewing activity) and Data Privacy (Matched Identifier Communications toggle, Opt Out of All button).",
      "phosraRelevance": "Privacy configuration for BANANA!!!!!!!!. Profile Lock and Viewing Activity accessible here. Data privacy settings relevant for COPPA compliance on Kids profiles.",
      "relatedRuleCategories": [
        "profile_lock",
        "viewing_history_access",
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation and toggle interaction",
        "notes": "Privacy page provides alternative path to Profile Lock and Viewing Activity. Data privacy toggle for marketing opt-out.",
        "technicalDetails": "await page.click('text=Profile Lock'); // or await page.click('text=Viewing activity');"
      },
      "findings": [
        {
          "label": "Profile Lock access",
          "detail": "Alternative navigation path to Profile Lock settings",
          "severity": "informational"
        },
        {
          "label": "Viewing activity access",
          "detail": "Alternative path to viewing history management",
          "severity": "informational"
        },
        {
          "label": "Marketing opt-out",
          "detail": "Matched Identifier Communications toggle and Opt Out of All button available",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clear privacy settings with distinct Viewing Privacy and Data Privacy sections."
      },
      "securityNotes": [
        "Data privacy opt-out especially relevant for child profiles (COPPA)"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's privacy controls more transparent than Peacock's.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Banana-profile-lock.png": {
      "filename": "deep-Banana-profile-lock.png",
      "description": "Create a Profile Lock page for BANANA!!!!!!!! showing 4-digit PIN creation interface with 'Create a Profile Lock' button and note about account password requirement.",
      "phosraRelevance": "PIN creation interface for BANANA!!!!!!!!. Critical for Phosra's screen time enforcement strategy — locking kids profile when daily limit reached.",
      "relatedRuleCategories": [
        "profile_lock",
        "screen_time_limit"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + password re-entry",
        "notes": "PIN creation for BANANA!!!!!!!! requires account password. 4-digit numeric PIN format.",
        "technicalDetails": "await page.click('text=Create a Profile Lock'); await page.fill('input[name=\"pin\"]', '1234'); await page.fill('input[type=\"password\"]', accountPassword);"
      },
      "findings": [
        {
          "label": "4-digit PIN",
          "detail": "Profile Lock uses 4-digit numeric PIN format",
          "severity": "important"
        },
        {
          "label": "Password required",
          "detail": "Account password re-entry needed (simpler than full MFA)",
          "severity": "important"
        },
        {
          "label": "Screen time enforcement",
          "detail": "Phosra locks this profile by changing PIN when daily limit reached",
          "severity": "critical"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Simple PIN creation page with clear instructions."
      },
      "securityNotes": [
        "Password verification required",
        "PIN stored in Phosra vault for lock/unlock operations"
      ],
      "apiIndicators": [
        "/api/shakti/*/parentalControls/pin"
      ],
      "comparisonNotes": "PIN lock mechanism similar to Peacock's. Critical for Phosra screen time strategy on Netflix.",
      "gapsIdentified": [
        "PIN alone does not enforce time limits — requires Phosra automation layer"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "deep-Banana-viewing-activity.png": {
      "filename": "deep-Banana-viewing-activity.png",
      "description": "Viewing activity page for BANANA!!!!!!!! showing watch history with title names, dates, and episode info. Entries show kids content (Larva Island, Blippi, etc.). Show More, Back to Your Account, Hide all, and Download all options visible.",
      "phosraRelevance": "Watch history for BANANA!!!!!!!!. Data source for getWatchHistory() adapter method. Shows kids content confirming maturity restrictions are working. Critical for Phosra's screen time monitoring via polling.",
      "relatedRuleCategories": [
        "viewing_history_access",
        "screen_time_limit"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Shakti API or Playwright scrape",
        "notes": "Viewing activity for BANANA!!!!!!!! readable via API. Title + date per entry, no duration data.",
        "technicalDetails": "/api/shakti/*/viewingactivity with x-netflix-profileguid header for BANANA!!!!!!!!"
      },
      "findings": [
        {
          "label": "Title + date entries",
          "detail": "Each entry shows title name, date watched, and episode/season info",
          "severity": "important"
        },
        {
          "label": "No duration data",
          "detail": "Watch duration per session not available — only title and date",
          "severity": "critical"
        },
        {
          "label": "Pagination",
          "detail": "Show More button for loading additional history entries",
          "severity": "informational"
        },
        {
          "label": "Export available",
          "detail": "Download all option for CSV export of viewing history",
          "severity": "informational"
        },
        {
          "label": "Kids content visible",
          "detail": "Viewing history shows age-appropriate content (Larva Island, Blippi) confirming maturity restrictions are effective",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Clean tabular layout with date, title, and action columns."
      },
      "securityNotes": [
        "Viewing history can be hidden by user, affecting monitoring accuracy"
      ],
      "apiIndicators": [
        "/api/shakti/*/viewingactivity"
      ],
      "comparisonNotes": "Netflix viewing history more detailed than Peacock's with CSV export. Kids profile history confirms maturity filtering works.",
      "gapsIdentified": [
        "No duration data limits screen time accuracy",
        "~30 min polling delay for monitoring"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "mfa-01-profiles-page.png": {
      "filename": "mfa-01-profiles-page.png",
      "description": "Profiles page showing profile selector before MFA verification. Shows all 5 profiles listed with maturity levels in a 'Select a profile' modal overlay.",
      "phosraRelevance": "Profile selection step that may appear during the MFA flow when accessing parental controls. User must select which profile's settings to modify before MFA verification.",
      "relatedRuleCategories": [
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright modal interaction",
        "notes": "Profile selector modal appears during MFA flow. Click on target profile to proceed.",
        "technicalDetails": "await page.click('[data-testid=\"profile-select\"] >> text=Samson');"
      },
      "findings": [
        {
          "label": "Profile selection required",
          "detail": "Must select target profile before MFA verification for parental controls",
          "severity": "important"
        },
        {
          "label": "Maturity levels shown",
          "detail": "Each profile displays current maturity level (e.g., TV-PG PG and below)",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Modal overlay with clean profile list layout."
      },
      "securityNotes": [],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's profile selection during MFA flow is unique — Peacock doesn't have this intermediate step.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "mfa-02-mfa-page.png": {
      "filename": "mfa-02-mfa-page.png",
      "description": "MFA verification page showing 'First, let's make sure it's you' heading with three verification options: Email a code (jake.k.klinvex@gmail.com), Text a code ((412) 566-7932), Confirm password. Help Center link at bottom.",
      "phosraRelevance": "Primary MFA gate page that blocks all parental control write operations. Three verification methods available. This is the critical barrier for Phosra's automation of Netflix parental controls. Password confirmation path is recommended for automation.",
      "relatedRuleCategories": [
        "parental_consent_gate",
        "content_rating_filter",
        "title_restriction"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright + password confirmation",
        "notes": "MFA page requires one of three verification methods. Password confirmation avoids external code retrieval (email/SMS).",
        "technicalDetails": "await page.click('text=Confirm password'); await page.fill('input[type=\"password\"]', password); await page.click('button[type=\"submit\"]');"
      },
      "findings": [
        {
          "label": "3 MFA methods available",
          "detail": "Email code, SMS text code, and password confirmation",
          "severity": "critical"
        },
        {
          "label": "Password preferred for automation",
          "detail": "Confirm password path avoids email/SMS code retrieval complexity",
          "severity": "critical"
        },
        {
          "label": "Email visible",
          "detail": "Account email shown in email verification option",
          "severity": "informational"
        },
        {
          "label": "Phone visible",
          "detail": "Phone number shown in SMS verification option",
          "severity": "informational"
        },
        {
          "label": "Session-based",
          "detail": "Once verified, MFA is not required again for that session",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Simple, clear MFA page with three distinct verification cards."
      },
      "securityNotes": [
        "MFA prevents children from modifying their own restrictions",
        "Email and phone number partially visible"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Netflix's MFA is the strongest among major streaming platforms. Peacock has no MFA for parental controls. This is the single biggest automation challenge for Phosra's Netflix adapter.",
      "gapsIdentified": [
        "No public API to bypass MFA — Playwright automation is the only path",
        "MFA may evolve to include additional methods (e.g., push notifications, biometric)"
      ],
      "relevance": "high",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "mfa-03-after-password.png": {
      "filename": "mfa-03-after-password.png",
      "description": "Post-MFA state after successful password verification. User is now authenticated for parental control changes within this session.",
      "phosraRelevance": "Confirms MFA completed successfully. Parental control write operations are now available for the duration of this session.",
      "relatedRuleCategories": [
        "parental_consent_gate"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright — proceed with settings changes",
        "notes": "After MFA verification, navigate to parental controls to make changes. Session remains verified.",
        "technicalDetails": "// MFA complete — now navigate to settings changes"
      },
      "findings": [
        {
          "label": "MFA verified",
          "detail": "Password verification accepted — session is now authorized for parental control changes",
          "severity": "important"
        },
        {
          "label": "Session active",
          "detail": "MFA verification persists for the current session",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Smooth transition to authenticated state."
      },
      "securityNotes": [
        "Session-based MFA means batch changes possible within one verification"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Post-MFA state allows batch parental control changes — important for efficiency.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "mfa-direct-maturity.png": {
      "filename": "mfa-direct-maturity.png",
      "description": "MFA gate triggered by direct URL navigation to maturity settings. Shows the MFA verification page with three options. ",
      "phosraRelevance": "Tests whether direct URL navigation to maturity settings triggers MFA or allows access. MFA gate confirmed on direct navigation. Important for understanding automation flow — can Phosra skip to specific pages or must it navigate through the UI?",
      "relatedRuleCategories": [
        "parental_consent_gate",
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright direct navigation",
        "notes": "Direct URL navigation to maturity settings triggers MFA.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account/maturity-settings');"
      },
      "findings": [
        {
          "label": "Direct navigation blocked",
          "detail": "MFA gate appears on direct URL access",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "MFA verification page."
      },
      "securityNotes": [
        "MFA triggered even on direct URL — no bypass possible"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Confirms Netflix enforces MFA regardless of navigation method — stronger than Peacock's approach.",
      "gapsIdentified": [
        "Direct URL navigation may return 404 for some paths — must navigate through UI hierarchy"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "mfa-direct-maturity-after.png": {
      "filename": "mfa-direct-maturity-after.png",
      "description": "Post-MFA direct URL navigation to maturity settings. Shows settings accessible after MFA completion. ",
      "phosraRelevance": "Tests whether direct URL navigation to maturity settings triggers MFA or allows access. Settings accessible after MFA verification. Important for understanding automation flow — can Phosra skip to specific pages or must it navigate through the UI?",
      "relatedRuleCategories": [
        "parental_consent_gate",
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright direct navigation",
        "notes": "Direct URL navigation to maturity settings works after MFA verification.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account/maturity-settings');"
      },
      "findings": [
        {
          "label": "Direct navigation works",
          "detail": "Settings accessible after completing MFA",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Settings page post-verification."
      },
      "securityNotes": [
        "Session-based MFA allows subsequent access"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Confirms Netflix enforces MFA regardless of navigation method — stronger than Peacock's approach.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "mfa-direct-parental-controls.png": {
      "filename": "mfa-direct-parental-controls.png",
      "description": "MFA gate triggered by direct URL navigation to parental controls. Shows the MFA verification page with three options. Note: shows 404 page - direct URL navigation may not work for all paths.",
      "phosraRelevance": "Tests whether direct URL navigation to parental controls triggers MFA or allows access. MFA gate confirmed on direct navigation. Important for understanding automation flow — can Phosra skip to specific pages or must it navigate through the UI?",
      "relatedRuleCategories": [
        "parental_consent_gate",
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright direct navigation",
        "notes": "Direct URL navigation to parental controls triggers MFA.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account/parental-controls');"
      },
      "findings": [
        {
          "label": "Direct navigation blocked",
          "detail": "MFA gate appears on direct URL access",
          "severity": "important"
        },
        {
          "label": "404 on some paths",
          "detail": "Some direct URLs return Netflix 404 page — must navigate through UI hierarchy",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "MFA verification page."
      },
      "securityNotes": [
        "MFA triggered even on direct URL — no bypass possible"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Confirms Netflix enforces MFA regardless of navigation method — stronger than Peacock's approach.",
      "gapsIdentified": [
        "Direct URL navigation may return 404 for some paths — must navigate through UI hierarchy"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "mfa-direct-parental-controls-after.png": {
      "filename": "mfa-direct-parental-controls-after.png",
      "description": "Post-MFA direct URL navigation to parental controls. Shows settings accessible after MFA completion. ",
      "phosraRelevance": "Tests whether direct URL navigation to parental controls triggers MFA or allows access. Settings accessible after MFA verification. Important for understanding automation flow — can Phosra skip to specific pages or must it navigate through the UI?",
      "relatedRuleCategories": [
        "parental_consent_gate",
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright direct navigation",
        "notes": "Direct URL navigation to parental controls works after MFA verification.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account/parental-controls');"
      },
      "findings": [
        {
          "label": "Direct navigation works",
          "detail": "Settings accessible after completing MFA",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Settings page post-verification."
      },
      "securityNotes": [
        "Session-based MFA allows subsequent access"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Confirms Netflix enforces MFA regardless of navigation method — stronger than Peacock's approach.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "mfa-direct-profile.png": {
      "filename": "mfa-direct-profile.png",
      "description": "MFA gate triggered by direct URL navigation to profile settings. Shows the MFA verification page with three options. ",
      "phosraRelevance": "Tests whether direct URL navigation to profile settings triggers MFA or allows access. MFA gate confirmed on direct navigation. Important for understanding automation flow — can Phosra skip to specific pages or must it navigate through the UI?",
      "relatedRuleCategories": [
        "parental_consent_gate",
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright direct navigation",
        "notes": "Direct URL navigation to profile settings triggers MFA.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account/profile-settings');"
      },
      "findings": [
        {
          "label": "Direct navigation blocked",
          "detail": "MFA gate appears on direct URL access",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "MFA verification page."
      },
      "securityNotes": [
        "MFA triggered even on direct URL — no bypass possible"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Confirms Netflix enforces MFA regardless of navigation method — stronger than Peacock's approach.",
      "gapsIdentified": [
        "Direct URL navigation may return 404 for some paths — must navigate through UI hierarchy"
      ],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "mfa-direct-profile-after.png": {
      "filename": "mfa-direct-profile-after.png",
      "description": "Post-MFA direct URL navigation to profile settings. Shows settings accessible after MFA completion. ",
      "phosraRelevance": "Tests whether direct URL navigation to profile settings triggers MFA or allows access. Settings accessible after MFA verification. Important for understanding automation flow — can Phosra skip to specific pages or must it navigate through the UI?",
      "relatedRuleCategories": [
        "parental_consent_gate",
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright direct navigation",
        "notes": "Direct URL navigation to profile settings works after MFA verification.",
        "technicalDetails": "await page.goto('https://www.netflix.com/account/profile-settings');"
      },
      "findings": [
        {
          "label": "Direct navigation works",
          "detail": "Settings accessible after completing MFA",
          "severity": "important"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Settings page post-verification."
      },
      "securityNotes": [
        "Session-based MFA allows subsequent access"
      ],
      "apiIndicators": [],
      "comparisonNotes": "Confirms Netflix enforces MFA regardless of navigation method — stronger than Peacock's approach.",
      "gapsIdentified": [],
      "relevance": "medium",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "mfa-manage-profiles.png": {
      "filename": "mfa-manage-profiles.png",
      "description": "Manage Profiles page accessed during the MFA verification flow, showing profile management interface.",
      "phosraRelevance": "Documents the Manage Profiles page during an MFA session. Profile management may or may not require MFA depending on the operation.",
      "relatedRuleCategories": [
        "kids_profile"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright navigation",
        "notes": "Manage Profiles accessible during MFA session.",
        "technicalDetails": "await page.goto('https://www.netflix.com/ManageProfiles');"
      },
      "findings": [
        {
          "label": "Profile management during MFA",
          "detail": "Manage Profiles page accessible within MFA-verified session",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard profile management grid."
      },
      "securityNotes": [],
      "apiIndicators": [],
      "comparisonNotes": "Profile management during MFA session similar to normal access.",
      "gapsIdentified": [],
      "relevance": "low",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    },
    "mfa-manage-profile-0-edit.png": {
      "filename": "mfa-manage-profile-0-edit.png",
      "description": "Profile 0 (Ramsay!) edit page accessed during MFA-verified session, showing profile edit interface.",
      "phosraRelevance": "Profile editing during MFA session. Confirms profile changes are possible within an MFA-verified session.",
      "relatedRuleCategories": [
        "kids_profile",
        "content_rating_filter"
      ],
      "automation": {
        "feasibility": "partially_automatable",
        "method": "Playwright form interaction",
        "notes": "Profile edit accessible and modifiable during MFA session.",
        "technicalDetails": "Standard profile edit form fill and save."
      },
      "findings": [
        {
          "label": "Profile edit in MFA session",
          "detail": "Profile editing works within MFA-verified session",
          "severity": "informational"
        }
      ],
      "ux": {
        "rating": "clean",
        "notes": "Standard profile edit form."
      },
      "securityNotes": [],
      "apiIndicators": [],
      "comparisonNotes": "Profile editing during MFA session — confirms batch operations possible.",
      "gapsIdentified": [],
      "relevance": "low",
      "analyst": "manual-review",
      "analyzedAt": "2026-02-26"
    }
  }
}